{
    "Fin1_2019_Aug": {
        "1.1": "Vis at modellen er arbitragefri og komplet.",
        "1.2": "Betragt en Call Option med udløb om 2 år og strike på K=160. Beregn optionens pris.",
        "1.3": "Betragt en Call Option med udløb om 3 år og strike på K = 160. Beregn optionens pris.\nAntag nu, at volatilitet og rente i standard binomialmodellen er tidsafhængige. Dvs. σt og rt nu bestemmer standard binomial (under)modellen fra tidspunkt t-1 til t. Antag som før at σt = σ2 og rt = r2.",
        "1.4": "Du får oplyst at \u001b1 = 0:35, \u001b2 = 0:25 og \u001b3 = 0:15. Vis at denne 3-periode model er arbitragefri og kompleks.",
        "1.5": "Genberegn call prisen fra 1.2 og 1.3 i denne model. Forklar hvorfor udløb-3 call'en nu er en smule billigere end i 1.3, men udløb-2 call'en nu er meget dyrere end i 1.2.",
        "1.6": "Betragt en n-periode model hvor t=c+0.35*exp(-0.07*t).\n\n(a) Antag c=0.01. Er modellen arbitragefri og komplet for alle n > 0? Find en evt. øvre grænse for n.\n\n(b) Bestem de værdier af c hvor modellen er arbitragefri og komplet for alle n>0."
    },
    "Fin1_2006_Apr": {
        "1.a": "Vis at modellen er arbitragefri og komplet.\nEn digital option er en kontrakt, der udbetaler 1 krone præcis hvis aktiekursen er højere end strikekursen K, dvs. dens pay-off er 1S(T) > K:\nBestem den arbitragefri tid-0 pris på en digital option med K = 500 og T = 2.",
        "1.b": "Nu betragtes en digital barriere-option. Dette er en kontrakt, der udbetaler 1 krone pr. tid 1, hvis aktiens kurs har været større end strikekursen K i hele optionens levetid, dvs. dens pay-off er 1 minu2[0;T]fS(u)g>K. Bestem prisen på en digital barriere-option med K=500 og T=2. Forklar hvordan den digitale barriere-option kan replikeres med aktien og den almindelige digital-option fra 1.a. (Der ønskes kun foretaget tid-0 beregninger.)",
        "2.a": "Hvad er korrelationen mellem to aktiers afkast? Bestem differencen mellem kapitalmarkedslinjen og porteføljevægtene for tangenterporteføljen. Vink: Det kan være nyttigt at vide at rø(0,1) = (2;1) >:",
        "2.b": "Antag at porteføljen er markedets portefølje og betragt en portefølje, x, med ligevægt i aktie 1, aktie 2 og det risikofri aktiv.\nHvad er x-porteføjens Sharpe-ratio? Er x-porteføljen effektiv?\nHvad er x-porteføjens beta-værdi? Vis at CAPM-relationen holder for x-porteføljen.\nEr du overrasket?",
        "3.a": "Vis for enhver Følge-målelig stokastisk variabel Z gælder at\nE(Z(X-E(X|Ft))) = 0:\nVink: Itererede forventninger.\nLad (stadig) Z være en vilkårlig Ft-målelig stokastisk variabel. Skriv\nX-Z = (X-E(X|Ft)) + (E(X|Ft)-Z):\nKvadrer dette, tag middelværdi og vis, at minimeringsproblemet præcist løses af den\nbetingede middelværdi, altså Z = E(X|Ft).\nVink: Du får tre led; det afhænger tydeligvis ikke af Z, er 0, og det er til at se, hvordan\ndet sidste led gøres mindst muligt.",
        "4.a": "call(0) = S(0) * Eq0 * call(1)\nS(1)\n\nhvor Eq0 indikerer, at der tages middelværdi med sandsynlighedsparameteren q0=(uq)/R.\nVink: Vis at højresiden i ligning (2) kan skrives som\nq0 * u * callup+1 - q0 * d * calldown\nog regn videre på det."
    },
    "Fin1_2009_Aug": {
        "Spg. 1a": "Vis modellen er arbitragefri og komplet.",
        "Spg. 1b": "Bestem arbitragefri priser på udløb-2, strike-105 call- og put-optioner.\nDer indføres nu en såkaldt X-kontrakt med tid-2 betalingen X(2) =1/(summation fra t=0 til 2 (S(t)/S(0))^2).",
        "Spg. 1c": "Find den arbitragefri tid-0 pris på X-kontrakten. (Hint: Tegn et træ.)",
        "Spg. 1d": "Kan KanX-kontrakten replikeres med call- og put-optionen fra spg. 1 .b?",
        "Spg. 2a": "Forklar kort, hvad en forwardrente er. (Definition, fortolkning.)",
        "Spg. 2b": "Betrag en model for optimal porteføljevalg som beskrevet i kap. 9 i Noterne; mere specifikt tilfældet med risikofri aktiv.\nArgumenter for, at alle porteføljer på den effektive rand (\"capital market line\") har samme Sharpe-ratio, og at denne er den maksimalt opnåelige blandt alle porteføljer.\nArgumenter for, at hvis nogen fandt på at måle/definere Sharpe-ratio som forventet merafkast (over den risikofri rente) i forhold til afkastvarians, så ville ovenstående udsagn ikke være sande.",
        "Spg. 2c": "Lad {X_i} være en følge af uafhængige stokastiske variable, der er standardnormalfordelte, dvs. X_i ~ N(0,1).\n\nDefinér M1(t) = 0 for t = 0 og M1(t) = Σ{X_i} for t ≥ 1.\n\nDefinér også M2(t) = 0 for t = 0 og M2(t) = Σ{X_i^2} - t for t ≥ 1.\n\nVis, at M1 og M2 er martingaler med hensyn til Xi'ernes naturlige filtrering.\n\nVis desuden, at M1 og M2 er ortogonale i den forstand, at E(M1(t)M2(t)) = 0 for alle t."
    },
    "Fin1_2013_Jun": {
        "Spg. 1a": "Vis at modellen er arbitragefri og komplet. Modellen er et specialtilfælde af standardbinomialmodellen, hvor S(t+Δt) = S(t) * exp(σ * Δt). Hvad er σ og volatiliteten? Vink: Tag log (dvs. ln) og få to lineære ligninger med to ubekendte.",
        "Spg. 1b": "En investor har købt en portefølje bestående af en call-option og en put-option på aktien.\nBegge optioner er af europæisk type, udløber på tid 2 og har strike-kurs 105. Bestem tid-0-prisen på porteføljen. Angiv den initiale sammensætning af den (aktie, bankbog)-portefølje, der replikerer optionsporteføljen.",
        "Spg. 1c": "Forestil dig nu, at den sande model for aktien er Black-Scholes-modellen eller standardbinomialmodellen med små tidsskridt, dvs. en model, hvor vi har et veldefineret mål for usikkerhed i form af volatiliteten σ. Hvordan vil værdien af optionsporteføljen fra spørgsmål 1.b afhænge af volatiliteten? Hvad nu hvis investoren i stedet havde solgt en call-option og købt en put-option?",
        "Spg. 2a": "Beregn tangentporteføljens Sharpe-ratio og angiv den påfølgende evne i den/de måde(er), du finder passende. (Det kan være nyttigt at vide, at Cov(RET;a,b) = (0,232794 0,242915).)",
        "Spg. 2b": "Antag at tangentporteføljen er markedsporteføljen. Verificer at CAPM-ligningen holder for en testportefølje med 25% vægt i hver aktie og 50% i det risikofrie aktiv. Hvad sker der med CAPM-ligningens validitet, hvis du ombytter test- og tangentportefølje i dine beregninger? (Overvej svarene: Holder/holder ikke, men næsten/holder ikke/holder langt fra.)\n\nHvis du ombytter test- og tangentporteføljen i dine beregninger, holder CAPM-ligningens validitet ikke, men den holder næsten.",
        "Spg. 3a": "I dette spg. ses bort fra inflation og lønstigninger. En nyuddannet mat/øk-kandidat indbetaler\nhvert år 19% af sin løn på en pensionsopsparing, hvor pengene forrentes med 3% per år. Ved\npensionering efter 30 år ønskes årlige pensionudbetalinger på 70% af lønnen. Hvor længe\nrækker pensionsopsparingen? Vink: Tegn en tidslinje.",
        "Spg. 3b": "I dette spørgsmål betragtes to købsoptioner med samme strike-kurs, K, men forskellige udløbstider, T2 > T1. Det underliggende aktiv udbetaler ikke udbytte i optionernes levetid, og renten er positiv. Vis at værdien af T2-købsoptionen altid er større end værdien af T1-købsoptionen. Vink: Brug Mertons tunnel til at sammenligne tid-T1-værdierne af optionerne.",
        "Spg. 3c": "I dette spørgsmål betragtes en aktie, der hver eneste periode udbetaler dividende med en bestemt rate. Specifikt er dividendebetalingen på tidspunkt i givet som Di = Si, hvor α er en konstant. Vis at der, med almindeligt anvendt notation, gælder følgende put-call-paritet:\n\nC(0) - P(0) = (1 + α)Si - d(0;T)×K\n\nVink: Lokalkarakterisation af Q og x - K = (x - K)+ + (K - x)+."
    },
    "Fin1_2010_Aug": {
        "Spg. 1a": "Vis at modellen er arbitragefri og komplet.",
        "Spg. 1b": "Beregn den arbitrage-fri tid-0-pris på en europæisk call-option (på aktien) med udløb på tidspunkt 2 og en strike-kurs på 85.",
        "Spg. 1c": "Angiv den oprindelige sammensætning af den (aktie, bankbog)-portefølje, der replikerer call-optionen fra spg. 1b.",
        "Spg. 1d": "Beregn den arbitragefri tid-0-pris på den amerikanske variant af call-optionen fra spg. 1b.",
        "Spg. 2a": "Bestem tangentporteføljen og angiv (på en måde, du finder passende) den effektive\nrand.\nVink: Det kan være nyttigt at vide, at ∇𝜇(𝜆) = (0,034722; 0,234375)>.",
        "Spg. 2b": "Betragt en nyttemaksimerende investor med kriteriefunktionen\nu(P, σ²) = P - σ²/20,\nhvor P og σ² angiver middelværdien og variansen for afkastraten på hans portefølje.\nHvilken portefølje vil denne investor vælge?\nHint: Begynd med en grafisk illustration af den effektive rand og \"samme nytte\"-kurver (isokvanter) i (middelværdi, varians)-rummet.",
        "Spg. 3a": "I rammen af Noternes kapitel 3 betragt en arbitrage-fri model med en ad rentestruktur. \nKommenter udsagnet \"varigheden på et stående lån vokser, når lånetid vokser\".",
        "Spg. 3b": "Lad Xj være en følge af uafhængige stokastiske variable (tilpasset en filtrering F), hvorom det gælder at P(Xj=2) = P(Xj=-2) = 1/2. Sæt N(0) = 0 og definer N(t) = t * sum(Xj*Xj) for 1 ≤ t ≤ T. Vis at N ikke er en martingal."
    },
    "Fin1_2011_Sep": {
        "Spg. 1a": "Vis at modellen er arbitragefri og komplet.",
        "Spg. 1b": "Bestem den arbitragesikre forward-pris for en forward-kontrakt med udløb på et tidspunkt 2 og aktien som underliggende.",
        "Spg. 1c": "Beregn den arbitrage-fri tid-0-pris på henholdsvis en europæisk og en amerikansk put-option (på aktien) med udløb på tidspunkt 2 og strike-kurs 96.",
        "Spg. 1d": "Angiv den initiale sammensætning af den (forward, bankbog)-portefølje, der replikerer den europæiske put-option fra spg. 1c, idet \"forward\" refererer til forward-kontrakten fra spg. 1b.",
        "Spg. 2a": "Bestem tangentporteføljen og angiv på en passende måde den effektive rand. (Det kan være nyttigt at vide, at ∇1 (µ; σ) = (0,09766; 0,12695)).",
        "Spg. 2b": "Antag at tangentporteføljen er markedsporteføljen. Verificer at CAPM-ligningen holder for aktie 1. Holder den også for aktie 2?",
        "Spg. 3a": "Hvad forstår du ved implicit volatilitet (også kendt som \"implied volatility\")?",
        "Spg. 3b": "Lad X_j være en følge af uafhængige standard-normalfordelte stokastiske variable, X_j ~ N(0,1), og lad F være X'ernes naturlige filtrering. Sæt N_1(0) = N_2(0) = N_3(0) = 0 og definer\n\nN_1(t) = t * ∑_(j=1)^t X_j^2, N_2(t) = t * ∑_(j=1)^(t-1) X_j * X_(j+1), og N_3(t) = t * ∑_(j=1)^t X_3^j for 1 ≤ t ≤ T.\n\nAnalyser N-processernes martingal-egenskaber (mht. F, først og fremmest)."
    },
    "Fin1_2007_Apr": {
        "Spg. 1a": "Betragt en futureskontrakt på aktien med udløb på tidspunkt 2. Bestem futuresprisen ved tidspunkt 0, F(0; 2). Angiv betalingerne for en investor, der køber/indgår en futureskontrakt ved tidspunkt 0, for alle stier gennem gitteret.",
        "Spg. 1b": "Betragt call-optioner (på aktien) med udløb på tidspunkt 1. Bestem arbitragefrie tid-0 priser på call-optioner med strike-kurser på henholdsvis 50 og 55. Vis, hvordan strike-55 call-optionen kan replikeres med aktien og strike-50 call-optionen.",
        "Spg. 1c": "Vis at to-periode-modellen er arbitragefri og inkomplet. Antag at en udløb-2 strike-70 call-option introduceres på markedet. Vis at det udvidede marked kun kan være arbitragefrit hvis tid-0 prisen på den introducerede call-option ligger i intervallet ]0;1.052-1. (Medmindre der sker meget mærkelige ting i andre knuder, så er denne betingelse også tilstrækkelig for fravær af arbitrage.) Vink: Undersøg først nærmere på delmodellen med \"rod\" i tid-1 op-tilstanden. Undersøg hvornår den er arbitragefri, især hvad der sker, hvis call-prisen her er henholdsvis 0 og 1.05.",
        "Spg. 2a": "Vis at nulkuponobligationspriserne er\n(P(0;1);P(0;2);P(0;3)) = (0.9524;0.9071;0.8640)\n2og angiv de effektive renter for nulkuponobligationerne.\nBestem EQ(∆t) for t= 0,1,2. Er ∆-processen en Q-martingal?",
        "Spg. 2b": "Angiv betalingsrække, tid-0 kurs samt Fisher/Weil-varighed for en 3-periode annuitet med 5% kuponrente og en initial hovedstol på 100.",
        "Spg. 2c": "Betragt en konverterbar version af annuiteten fra spg. 2b. Dette betyder, at låntageren (altså sælgeren af obligationen) på et hvilketsomhelst tidspunkt kan slippe ud af sine fremtidige forpligtelser ved at betale den resterende hovedstol tilbage. Han ejer med andre ord en amerikansk call-option (med tidsvarierende strike-kurs = resterende hovedstol) på annuiteten.\nArgumenter for, at værdien af den konverterbare obligation, VKA, er\nVKA(t) = min(H(t),1/(1+r(t)) * EQ * t * (VKA(t+ 1) + y)),\nhvor H og y er henholdsvis hovedstolen og ydelsen på annuiteten.\nBeregn kursen på den konverterbare annuitet og angiv, i hvilke knuder i rentegitteret der konverteres."
    },
    "Fin1_2008_Aug": {
        "Spg. 1a": "Vis de arbitragefri nulkuponobligationspriserne ved tidspunkt t=0 som: P(0;1); P(0;2); P(0;3) som: \n= (0.9524;0.9073;0.8605):\nBestem de tilhørende effektive renter y(0;t) for t= 1;2;3.\nBestem forward-renterne f(0;t) for t= 0;1;2.",
        "Spg. 1b": "Betragt nu et 2-periode annuitetslån med en hovedstol på 100 og en kuponrente på 7%, der løber fra tidspunkt t=1 til t=3 (dvs. lånet afdrages på tidspunkterne t=2 og t=3).\nAngiv annuitetslånets betalingsrække samt de tre mulige priser på lånet til tidspunktet t=1 afhængigt af værdien for \u001a1.\nAngiv prisen F0;1 på en futures-kontrakt for køb af annuitetslånet til tidspunktet t=1.\nHvad er prisen F0;1 på den tilsvarende forward-kontrakt til tidspunktet t=0?",
        "Spg. 2a": "Bestem porteføljevægte wGMV og forventet afkastrate GMV for den globale minimum-varians-portefølje. (Vink: Udnyt evt. at A= [40 20; 20 60] og B= [1; 1] / [40 20; 20 60])\nBestem porteføljevægte wmv for minimum-varians-porteføljen med forventet afkastrate mv= 0.08. (Vink: Udnyt evt. at B= [28 2; 2 0.15])",
        "Spg. 2b": "Gør rede for at 𝑧𝑚𝑣𝟔=𝑚𝑣, hvor 𝑧𝑚𝑣𝑒𝑟 forventet afkastrate for den minimum-varians-portefølje 𝑤𝑧𝑚𝑣, der er ortogonal med 𝑤𝑚𝑣 fra spg. 2a.\n(Vink: Betragt porteføljen ~𝑤=1/2𝑤𝑚𝑣+1/2𝑤𝑧𝑚𝑣 og vis at 𝑧𝑚𝑣=𝑚𝑣 fører til en modstrid ved at se på Var(~𝑤)). Det er ikke nødvendigt først at beregne 𝑤𝑧𝑚𝑣)\nGør rede for at der findes τ2R, således at\n𝑤𝐺𝑀𝑉 =τ𝑤𝑚𝑣+ (1−τ)𝑤𝑧𝑚𝑣: (1)\n(Vink: 2-fonds-separation)",
        "Spg. 2c": "Vis at GMV < zmv, idet det oplyses, at i ligning (1) opfylder 0 < z < 1.\n(Vink: Det følger fra spg. 2a at zmv > GMV)\nAfgør omvendt en effcient portefølje.",
        "Spg. 3a": "Forklar hvad der menes med, at det kan være attraktivt at købe en straddle, hvis man forventer store udsving i aktiekursen, men ikke ved i hvilken retning. Forklar hvordan man kan udnytte en straddle, hvis man i stedet forventer små udsving i aktiekursen. Vi lader i det følgende Call t;T(St;K) hhv. Put t;T(St;K) betegne prisen til tidspunkt t på en europæisk call- hhv. put-option med strike kurs K og udløb til tidspunkt T skrevet på aktien med kurs St til tidspunkt t.",
        "Spg. 3b": "Der gælder for to ikke-dividende betalende aktier med aktiekurser St og Vt, følgende:\n\nCall t;T(St+Vt;2K) ≤ Call t;T(St;K) + Call t;T(Vt;K)\n\nPut t;T(St+Vt;2K) ≤ Put t;T(St;K) + Put t;T(Vt;K)\n\nIntuitionen bag dette resultat kan forklares ved at se på tilfældet, hvor den ene aktiekurs er meget lav og den anden er meget høj. Her vil værdien af de tre call-optioner henholdsvis put-optioner også være påvirket.\n\nDer er ikke angivet noget maksimumsymbol i den oprindelige tekst, så det antages her, at ≤ (mindre end eller lig med) skal anvendes i stedet.\n\n(Vink er et dansk ord, men det forstår jeg ikke helt sammenhængen af her, så jeg har udeladt det fra den fiksede tekst. Vink kan betyde \"hint\" eller \"suggestion\" på engelsk.)"
    },
    "Fin1_2018_Aug": {
        "Spg. 1a": "Vis at modellen er arbitragefri og komplet, især at alle én-periode undersmodeller har risikoneutrale op-sandsynligheder p på 3/5.",
        "Spg. 1b": "Beregn Fwd(0;2) (dvs. forwardprisen på en aktie-forwardkontrakt, der udløber på tidspunkt 2).",
        "Spg. 1c": "Bestem tid 0-prisen for en udløb-2, strike-100 europæisk call-option på en aktie og angiv sammensætningen af den replikerende (aktie, bankbog)-portefølje.",
        "Spg. 1d": "Beregn prisændringen fra tid 0 til tid 1 for den europæiske put-option på spørgsmål 1c. Holder put-call-pariteten?",
        "Spg. 1e": "En agent investerer 100 kr. ved tid 0 i en selvfinansierende portefølje (bestående af aktier og en bankbog), som beholdes indtil tid 2. Dette gøres, så værdien af aktieinvesteringen til enhver tid er 50 kr. Angiv antallet af aktieenheder og bankbogsenheder, som agenten har ved tid 0 og tid 1, samt de mulige værdier af porteføljen ved tid 2. Hvad er forventningen til porteføljens værdi ved tid 2, hvor Q er det sædvanlige martingalalet?",
        "Spg. 2a": "De naturligt ordnede priser af nulkuponobligationer ved tid 0 er givet ved (0,9804; 0,9595; 0,9272). Angiv tid 0-forward-renterne, f(0;t).",
        "Spg. 2b": "Betragt en 3-periode ( N= 3) annuitetslån, også kaldet en annuitetsobligation eller bare en annuitet, med en initial hovedstol ( F) på 100 og en kuponrente ( R) på 0.03 (dvs. 3%). Beregn denne låns tid 0-kurs og den tilhørende effektive rente.",
        "Spg. 2c": "Nu betragtes en variabelt forrentet version af annuiteten fra spg. 2b. Dette lån har den samme afdragsprofil (altså samme afdragsbetalinger), men rentebetalingen er på (ethvert) tidspunkt t+1, hvor H betegner hovedstol. Vis at tid 0-kursen på denne annuitet er 100.",
        "Spg. 2d": "Nu betragtes en såkaldt N-periode som-om-annuitet. Dette er et lån, hvor den resterende hovedstol udvikler sig efter Ht=Ht-1*(1+r(t))*y(t), idet ydelserne, y(t), er bestemt ved y(t) =Ht-1*r(t)*(1+r(t))^N*(t-1)/(1+r(t))^N*(t-1)-1;\ndvs. som om man havde en annuitet, idet dog kuponrenten skiftes med den variable korte rente. For en som-om-annuitet med H0= 100 og N= 2, angiv da dens betalinger (i et år) og beregn dens tid 0-kurs (som ikke eksakt er 100)."
    },
    "Fin1_2012_Jun": {
        "Spg. 1a": "Vis at modellen er arbitrage-fri og komplet.",
        "Spg. 1b": "Beregn den arbitrage-fri tid-0-pris på en europæisk call-option (på aktien) med udløb på tidspunkt 2 og en strike-pris på 105. Angiv den initiale sammensætning af den (aktie, bankbog)-portefølje, der replikerer call-optionen.",
        "Spg. 1c": "Bestem tid-0 prisen på en udløb-2 nulkuponobligation. Beregn korrelationen under P mellem aktiens tid-0-til-1 afkast (dvs. S(1)/S(0)) og udløb-2 nulkuponobligationens afkast over samme (ene) periode.",
        "Spg. 2a": "Bestem tangentporteføljen og angiv (på den/de måde(r), du finder passende) den effektive rand. (Det kan være nyttigt at vide, at √(1-ρ^2) = (0.19754, 0.17394).)",
        "Spg. 2b": "Antag, at tangentporteføljen er markedsporteføljen. Verificer, om CAPM-ligningen holder for en portefølje med vægte på 50% i hver aktie.",
        "Spg. 3a": "Antag, at aktien ikke udbetaler dividende mellem tid 0 og tid T. Vis at \n\nEQ\n0(S(T)) = (1 + r)TS(0): \n\nVink: Brug den generelle regel S(t) = S(t+1)/(1+r) rekursivt baglæns.",
        "Spg. 3b": "Antag nu i stedet, at aktien udbetaler det deterministiske beløb Di som dividende (eller udbytte) på tidspunktet tD, hvor tD er mellem 0 og T. Vis at\n\nEQ0(S(T)) = (1 + r)TS(0) - (1 + r)T-tD * Di\n\nVink: Vis at EQtD-1(S(tD)) = (1 + r)StD-1. Dog argumenter som i",
        "Spg. 3c": "Brug resultatet i den følgende tekst:\n\nHvordan kan vi forbedre vores produkt og øge salget? Det er et spørgsmål, som mange virksomheder stiller sig selv. For at finde svar på dette spørgsmål, er markedsundersøgelser en nødvendig og værdifuld del af processen. Markedsundersøgelser kan hjælpe os med at identificere konkurrenter, målgrupper og nye trends.\n\nEn effektiv markedsundersøgelse kræver en klar målsætning og en detaljeret plan for indsamling af data. Vi skal være sikre på, hvilke informationer vi ønsker at få, og hvordan vi bedst kan indsamle dem. Der er mange metoder til rådighed, som f.eks. spørgeskemaer, interviews og observationer.\n\nNår vi har indsamlet vores data, er det vigtigt at analysere dem grundigt. Vi skal se efter mønstre, tendenser og muligheder for forbedringer. På baggrund af vores analyser kan vi træffe informerede beslutninger om, hvordan vi kan optimere vores produkt og øge salget.\n\nEn markedsundersøgelse er en dynamisk proces, der kan gentages og justeres efter behov. Det er vigtigt at være opdateret med den nyeste viden og altid være åben for nye ideer og muligheder. Ved at bruge resultaterne fra vores markedsundersøgelser kan vi opnå succes og holde os konkurrencedygtige på markedet."
    },
    "Fin1_2013_Aug": {
        "Spg. 1a": "Beregn den arbitragefri pris på en europæisk put-option, der udløber på tidspunktet 3 og har en strikekurs på 105.",
        "Spg. 1b": "Beregn den arbitragefri pris på en amerikansk put-option, der udløber på tidspunktet 3 og har en strike-kurs på 105.",
        "Spg. 1c": "Betragt en udløb-2 futures-kontrakt på aktien. Angiv futures-kontraktens betalinger på tid 1 og 2.",
        "Spg. 1d": "Hvordan kan put-optionen replikeres med det risikofrie aktiv og futures-kontrakten fra spg. 1c?",
        "Spg. 2a": "Angiv den effektive rand på den/de måde(r), du finder passende. (Det kan være nyttigt at vide, at α(μ0;01μ1) = (0,2941 0,1765 0,0588)>.",
        "Spg. 2b": "Antag tangentporteføljen er markedets portefølje. Verificer at CAPM-ligningen holder for en portefølje med 50% vægt i hver aktie og -50% i det risikofrie aktiv (altså en kort position, lånefinansieret aktieinvestering).",
        "Spg. 3a": "I dette spørgsmål ses bort fra inflation og lønstigninger. En nyuddannet matematik-kandidat indbetaler hvert år 18% af sin løn på en pensionsopsparing, hvor pengene forrentes med 3% per år. Ved pensionering efter 35 år ønskes årlige pensionudbetalinger på en fast andel af lønnen i 15 år. Hvor stor kan denne andel være? Vink: Tegn en tidslinje og foretag nogle numeriske beregninger.",
        "Spg. 3b": "Hvis renten er 0, og det underliggende aktiv ikke udbetaler dividende, er det ikke optimalt at indfri/udøve amerikanske put-optioner for tidligt. Hint: Tidsværdien af en amerikansk put-option, der ikke udøves på tidspunktet t (<T), er større end eller lig med værdien af en europæisk put-option på samme tidspunkt t (PutE(t)), som igen er større end eller lig med værdien af en europæisk put-option på samme tidspunkt t (PutE(t)) minus værdien af en europæisk call-option på samme tidspunkt t (CallE(t)). Nu kan put/call-pariteten anvendes."
    },
    "Fin1_2019_Jun": {
        "1.1": "Vis at markedet er arbitragefrit men ikke komplet. (Hint: Man kan nemt finde en løsning \n3x1 ≠ 0 til ligningssystemet D = h hvis man sætter de første to indgange i \n3x1 til at være ens)",
        "1.2": "Betragt et marked, hvor du kan købe A, det risikofrie aktiv, samt en strike K = 100 og udløbstid = 1 Call Option med A som det underliggende aktiv. Antag prisen på Call-optionen er C0 = 5. Vis at dette udvidede marked er både arbitragefrit og komplet.",
        "1.3": "Tag udgangspunkt i call-optionen fra det tidligere spørgsmål, hvor vi har strike-prisen K = 93 og prisen C0 = 8,82352941. Vis, at dette udvidede marked er arbitragefrit, men ikke komplet.",
        "1.4": "Betragt en K = 100 call option fra spørgsmål 1.2, og antag nu at du ikke kender prisen C0. Hvad er den størst mulige arbitragefri pris for C0?",
        "2.1": "Beregn den globale minimum varians portefølje. Oplys porteføljens vægte og beregn dens forventede afkast(rate) og afkastets standardafvigelse. (Hint: jeg får den forventede afkast rate til \u0016GMV = 0,05692).",
        "2.2": "Nu vi har et risikofrit aktiv med rente på 0. Du får oplyst at tangentporteføljen i økonomien har en forventet afkastrate på tan=0,11015. Beregn 0 og beregn tangentporteføljens vægte og standardafvigelsen på tangentporteføljens afkastrate. (Hint: det risikofrie aktiv er ortogonalt på tangentporteføljen)",
        "2.3": "Tag nu i stedet for det risikofrie aktiv har en afkastrate på \u00160= 0,07. Find en effektiv portefølje P med en forventet afkastrate på \u0016P= 0,08. Oplys P's vægte.",
        "2.4": "An tag fortsat 1= 0,07. Forklar hvorfor der i dette tilfælde ikke findes en effektiv portefølje som kun består af risikable aktiver. Lav eventuelt en tegning.",
        "2.5": "Antag nu at de to aktiviteter kan beskrives ud fra følgende 'faktormodel':\n\nri = βi + αiFm + εi, i = 1,2 (2)\n\nHvor Fm, α1 og α2 er indbyrdes uafhængige stokastiske variable med\nE[Fm] = E[αi] = 0, i = 1,2\nOg σ1 = σ2 og σm := Std[Fm].\n\nAntag yderligere at β1 = 1.1 , β2 = 0.7 , α1 = 0.1 og α2 = 0.05.\nVis modellen beskrevet i (2) producerer samme forventede afkast som i ligning (1) og bestem σ1 og σm så modellen i ligning (2) har den samme varians-kovariansmatrix som den opgivet i (1).",
        "2.6": "Antag nu at F1 og F2 er indbyrdes uafhængige stokastiske variable som er binomialfordelt med p(F1=0)=0,18 og p(F2=0)=0,12 samt P(1=0,095) = P(2=0,095) og P(1= -0,095) = P(2= -0,095). \nDisse antagelser beskriver sammen med ligning (2) og de opgivne parameterværdier fra spørgsmål 2.5 et marked i en periode (N=1,D=S) med N=2 risikable aktiver og S=23=8 forskellige tilstande. \nAntag at priserne er givet ved \u0019=1/1, dvs. række 1 og 2 i D angiver værdien af at investere 1 kr. i hhv. aktiv 1 og 2, for de 8 forskellige tilstande i markedet. \nBeregn pay-off matricen D og vis at (\u0019,D) er arbitragefrit men ikke komplet."
    },
    "Fin1_2011_Jun": {
        "Spg. 1a": "Vis at modellen er arbitragefri og komplett.\n\nBetragt et finansielt aktiv, en såkaldt IFN-kontrakt, der på tid T=3 har følgende \"pay-off\"-struktur:\n- Hvis S(T) ≤ 100, så modtager investor (eller: ejeren) 100.\n- Hvis 100 < S(T) ≤ 125, så modtager investor 0.8*S(T) + 20.\n- Hvis S(T) > 125, så modtager investor 120.",
        "Spg. 1b": "Vis at IFN-kontrakten kan skrives som en portefølje af nulkuponobligationer og call-optioner. Beregn den arbitrage-fri tid-0-pris på IFN-kontrakten.\nDer mindes om, at hvis der investeres i et dividende-frit aktiv over horisonten \u001c, så er den annualiserede forventede afkastrate givet ved formlen:\n\u0012\nE(r)\n= (\u0012pris(\u001c)/pris(0)) - 1\n\u001c\n\u00001:",
        "Spg. 1c": "Antag at IFN-kontrakten handles til sin arbitrage-fri tid-0 pris, og betragt dens afkastrate over horisonten T = 3. (Og pedanter omdefinerer \"tid-3 pay-off\" til \"tid-3 pris\".)\nHvad er den P-forventede afkastrate for IFN-kontrakten? Hvad er den Q-forventede afkastrate for IFN-kontrakten, hvor Q som sædvanlig indikerer middelværdi under martingal-målet/det risiko-neutrale sandsynlighedsmål?",
        "Spg. 1d": "En stor bank markedsfører IFN-kontrakten ovenfor som et investeringsprodukt på følgende måde:\nSpil aktiemarkedet uden nogen risiko! Hvis du investerer 100 kr hos os, kan du tjene op til 20%. Og hvis aktiemarkedet falder, får du dine penge tilbage.\n(Dette er \"based on a true story\", så jeg har beholdt den originale engelske ordlyd.)\nKommentar: Dette er en villedende information for investoren. Selvom det ser ud til, at der ikke er nogen risiko ved at investere i IFN-kontrakten, er der faktisk mange vildledende oplysninger i det korte citat. For det første er der ingen investering uden risiko, og det at påstå at man kan spille aktiemarkedet uden risiko er vildledende. Derudover er der ingen garanti for en afkast på 20% - det kan være mere eller mindre, eller endda ingen afkast overhovedet. Og selvom der står, at man får sine penge tilbage, hvis aktiemarkedet falder, er der ingen oplysninger om eventuelle omkostninger eller gebyrer, der kan påvirke investorens afkast. Derfor er det vigtigt at læse kontraktens vilkår og betingelser grundigt, før man foretager en investering.",
        "Spg. 2a": "Vis at nulkuponobligationspriserne på tid 0 er\n(P(0;1);P(0;2);P(0;3)) = (0,9804;0,9613;0,9313).",
        "Spg. 2b": "Beregn forwardprisen for en forwardkontrakt med udløbstidspunkt Tfwd= 1på en \"T=3\"-nulkuponobligation. Hvad er futuresprisen for en futureskontrakt med samme udløbsdato og underliggende aktiv som forwardkontrakten? Ændrer dine svar sig kvalitativt, hvis forward- og futureskontrakterne har udløb på tid 2 i stedet?",
        "Spg. 2c": "En bestemt 3-periode annuitetsobligation har på tid 0 arbitrært fri pris lig med sin resterende hovedstol (100, uden tab af generalitet). Hvad er annuitetens kuponrente? (Angiv først hvilken ligning, der bestemmer kuponrenten. Beregn derefter løsningen numerisk med et par betydende cifre.)"
    },
    "Fin1_2018_Jun": {
        "Spg. 1a": "Vis, at modellen er arbitragefri og inkonsekvent. Vink: (1/3, 1/3, 1/3)",
        "Spg. 1b": "Find den 0-pris og den initiale sammensætning af den replikerende portefølje (bestående af aktier og bankbog) for en put-option på aktien, der udløber på tidspunktet T = 2 og har en strike-pris på K = 100.",
        "Spg. 1c": "Betragt en put-option, der har udløb på tidspunkt T = 3 og strike K = 100. Argumenter for, at den har en entydigt bestemt arbitragefri tid 0-pris, og beregn denne.",
        "Spg. 1d": "Betragt en forward-kontrakt på aktien med udløb på tid 3. Argumenter for, at der er en entydigt bestemt arbitrage-fri tid 0-forwardpris, Fwd(0 ;3), og beregn denne.",
        "Spg. 1e": "Antag nu at dividenderne i den øverste tid 2-til-3-delmodel i gitteret ændres til (1,4,1) i henholdsvis op-, midt- og ned-tilstanden. (De øvrige dele af modellen ændres ikke; den får derfor formelt set en træ-struktur.) Hvad kan du nu sige om arbitrage-frie værdier af Fwd(0 ;3)? Et kvalitativt svar er tilstrækkeligt.",
        "Spg. 2a": "Angiv (gennem ligninger og figurer) de kombinationer af (forventet afkast, afkastspridning), der kan opnås ved porteføljer, der er konvekse kombinationer af aktie 1 og 2. (En sådan portefølje har en vægt α i aktie 1 og 1-α i aktie 2, hvor α ∈ [0, 1].)",
        "Spg. 2b": "Angiv den effektive rand i modellen på den/den/de måder, du finder passende.\nVink: Det kan være nyttigt med standardnotation at vide at\nA = [1 1 \n    1 1] = [0.05836 1.32787 \n             1.32787 34.42623]",
        "Spg. 2c": "Modellen udvides nu med et risikofrit aktiv med en rente på 0,01 (dvs. 1 %).\nAntag, at tangentporteføljen er markedsporteføljen. Verificer, at CAPM-ligningen holder for en portefølje med vægt 1/3 i hver aktie.",
        "Spg. 3a": "Staten udsteder/sælger 30-årige stående lån med årlige terminer og kuponrente på 5% og ønsker at gøre dette, så der ved salget opnås et provenu på 50 milliarder kroner. Hvilken hovedstol skal lånet have, og hvad er dets effektive rente? Staten udlåner nu de 50 milliarder til den nødlidende bank StorDanskBank. Dette sker i form af et 5-årigt serielån med hovedstol på 50 milliarder og kuponrente på 10%. Hvad er nutidsværdien af dette lån (idet det antages, at banken betaler det tilbage fuldt ud)?"
    },
    "Fin1_2008_Apr": {
        "Spg. 1a": "Vis at de arbitragefri nulkuponobligationspriser til tidspunkt t=0 er P(0;1), P(0;2), P(0;3) = (0.9615, 0.9203, 0.8696). \nBestem de tilhørende effektive renter y(0;t) for t=1, 2, 3. \nBestem forward-renterne f(0;t) for t=0, 1, 2.",
        "Spg. 1b": "Angiv prisen F0;1 på en forward-kontrakt på køb af en 2-periode nulkuponobligation til tidspunkt t=1 (dvs. til prisen P(1;3)). Udtryk forward-prisen F0;1 ved hjælp af forward-renterne f(0;t) fra spg. 1a. Forklar intuitionen bag sammenhængen mellem F0;1 og forward-renterne.",
        "Spg. 1c": "Angiv prisen F(0;2) til tidspunkt t=0 for en forward-kontrakt på køb af en 1-periode nulkuponobligation til tidspunkt t=2 (dvs. til prisen P(2;3)).\nAngiv prisen til tidspunkt t=0 for en europæisk call-option med udløb til tidspunkt t=2 og strike K=F(0;2) skrevet på nulkuponobligationen udstedt til tidspunkt t=0 og med udløb til tidspunkt t=3.\nHvad er prisen på den tilsvarende amerikanske call-option?\nForklar hvordan man ud fra ovenstående - og uden yderligere beregning - kan finde prisen på den tilsvarende europæiske put-option.",
        "Spg. 2a": "Visse værdi af obligationerne på tidspunktet t er givet som\n\nBt = Vt - Vt * exp(-d1 * Tt) + Der(Tt) * d1 * sqrt(Tt)\n\nhvor d1 = (log(Vt / D) + (r + 0.5 * Tt) * Tt) / (sqrt(Tt) * Vink: Put-call-pariteten)",
        "Spg. 2b": "Visat\nVi har følgende formel:\nVt'(d1) = De^(-0.5*d1^2) / sqrt(2*pi)\nhvor f(x) = (1/sqrt(2*pi)) * e^(-0.5*x^2) er tæthedsfunktionen for standardnormalfordelingen.\n(Vink: Skriv om på d1 i formel (1))\n\nVisdernæst ved brug af (1) at\n@Bt\n@σ = Vt'(d1) / (S*sqrt(T)) (2)\n(Vink: Saml faktorer der involverer d1)",
        "Spg. 2c": "Da variansen på VTer en voksende funktion af volatiliteten σ, kan man fortolke σ som et mål for usikkerheden omkring aktivernes fremtidige værdi. Man kan desuden tænke på σ som en variabel, hvis værdi helt eller delvist fastsættes af virksomhedens ejere. Forklar med udgangspunkt i ligning (2) obligationsejernes holdning til et eventuelt ønske fra virksomhedsejerne om at øge virksomhedens risiko (dvs. øge σ). (Vink: Der kan gives argumenter både for og imod. Alligevel fastlægger ligning (2) en entydig holdning hos obligationsejerne. Overvej hvorfor.)",
        "Spg. 3a": "Forklar hvad det betyder at man kan øge sin renterisiko ved at handle renteswaps, samt hvordan det kan være fordelagtigt i tilfælde af et efterfølgende rentefald.\n(Vink: Hvilken \"ben\" i swap'en skal man betale for at opnå de ønskede effekter?)\nForklar kort hvorfor nutidsværdien af fremtidige forpligtelser stiger som følge af et rentefald.\n(Vink: Tag for eksempel udgangspunkt i definitionen af nutidsværdi for en deterministisk betalingsrække).\nForklar kort hvilken rolle begrebet varighed spiller i denne sammenhæng."
    },
    "Fin1_2022_Jun": {
        "Spg. 1a": "Vis, at modellen er både arbitragefri og komplet.",
        "Spg. 1b": "Betragt en europæisk 2-købsmulighedsoption på en aktie med en strikekurs på K=101.5. Vis at K = EQ(S(1)) = (1 + r)S(0). Hvad er den arbitragefrie tidspris på denne købsmulighed ved tidspunkt 0? Beregn den replikerende portefølje (aktie, bankkonto) for købsmuligheden.",
        "Spg. 1c": "Betragt nu en udløb-2 forward starting-call-option. Det er et aktiv, der betaler (S(2)-S(1))+\np0 a tid 2, dvs. striken sættes, så a optionen altid er at-the-money p0 a tid 1. Beregn den arbi-\ntragefrie tid 0-pris p0 a forward starting-call-optionen. (Vink: Tegn et træ.)",
        "Spg. 1d": "Prisen på den forward-startende aktieoption fra spg. 1c er lavere end prisen på call-optionen fra spg. 1b. Forklar hvorfor. (Vink: Husk at prisen på call-optioner generelt stiger med variansen på det underliggende aktiv.)",
        "Spg. 2a": "Angiv vægtene, xmv, for den minimum-varians-portefølje, der har forventet afkast rate µmv= 0,05. Vis at xmv's 0-beta-portefølje har forventet afkast rate µzmv= 0,01765. Verificer (med tal) at 0-beta-versionen af CAPM (Proposition 5 i noterne) holder med aktie 1 på venstre side og xmv som referenceportefølje på højre side.",
        "Spg. 2b": "Modellen udvides nu med et risikofrit aktiv med en rente på r_0 = μzmν. \nVis at x_m er tangentporteføljen. \nVink: Ideelt set ønskes et teoretisk bevis, men man kan jo altid starte med en numerisk verifikation (som kræver numerisk matrixregning). \nHvad er den højest muligt opnåelige Sharpe-ratio? \nVink: Benyt resultatet fra første del af dette spørgsmål – også selvom du ikke har bevist det.",
        "Spg. 3a": "Vis, at nulkuponobligationspriser (naturligt ordnet) på tidspunktet 0 er givet ved (0,9524; 0,8947; 0,8199). Beregn nulkuponrenterne på tidspunktet 0.",
        "Spg. 3b": "Betragt en 3-periode-annuitetsobligation med en hovedstol på 100 og en kuponrente på 0,05 (dvs. 5%).\nHvad er ydelsen (yA), obligationens tid 0-kurs (A(0)) og dens effektive rente? Man antager sælger obligationer af denne type således, at hendes tid 0-provenu er 1.000.000 (en million - kr. fx). Hvad er hendes årlige ydelse på lånet?",
        "Spg. 3c": "Vi betragter nu forward- og futureskontrakter med udløb på tidspunktet 2 og med annuitetsobligationen fra spg. 3b som underliggende aktiv. Beregn forwardprisen på tidspunktet 0 (Fwd(0; 2)) og futuresprisen på tidspunktet 0 (Fut(0; 2))."
    },
    "Fin1_2007_Aug": {
        "Spg. 1a": "Beregn den arbitrationsfri tid-0 pris på en call-option med udløb på tidspunkt (T) 3 og strike-kursen (K) 190. \nCall-optionen kan replikeres med en (dynamisk justeret) portefølje, der indeholder en aktie og en bankbog. Angiv sammensætningen af denne replikerende portefølje på tid 0.",
        "Spg. 1b": "En såkaldt down-and-out call-option er en kontrakt, der på et fastlagt udløbstidspunkt har samme payoff som en almindelig call-option med strike K, hvis aktiekursen har holdt sig over barriereniveauet B i hele optionens levetid, ellers er payoff 0. Eller mere kompakt: Payoff πdoc(T) er givet ved\nπdoc(T) = (S(T)−K)+1min{S(u)|0≤u≤T}>B,\nhvor 1 betegner indikatorfunktionen.\nBeregn tid-0-prisen på en down-and-out call-option med T=3, K=190 og B=165.\nVink: Tegn et træ.",
        "Spg. 1c": "Betragt en stokastisk proces fastlagt ved:\n• For tid T: π1(T) = (S(T)−K)+1S(T)>B\n• For tid t < T: π1(t) =1S(t)>BEQ\nt(π1(t+ 1)/(1 +r))\nHold fast i T=3, K=190 og B=165. Angiv π1's værdier på de forskellige knuder i gitteret.\nArgumenter for, at det ikke er en tilfældighed, at π1(0) = πdoc(0).\nForklar, hvorfor dette (sammenlignet med træet fra spg. 1b) er en effektiv måde at beregne prisen på en down-and-out call-option.",
        "Spg. 2a": "Vis at\nµC - R = S\nC0a(µS - R),\nhvor (som i Noterne) a = (Cu - Cd)/((u - d)S).\nVink: Vis først at\nauS - Cu = (aS - C0)R,\nadS - Cd = (aS - C0)R,\nog gang så a med p og 1 - p og læg sammen.",
        "Spg. 2b": "Antag at aktiens forventede merarate er fastlagt ved en CAPM-relation:\n\nµS-R=βS,M(µM-R),\n\nhvor M henviser til en ikke nærmere specificeret markedsportefølje.\n\nHvordan ser CAPM-relationen ud for call-optionen; hvad er dens β?\nHvordan er de to β'er (henholdsvis aktiens og call-optionens) i forhold til hinanden?\nVink: Da C0=aS+b, kan forholdet aS/C0 vurderes ud fra fortegnet på ab = (uCd-dCu)/((u-d)R).",
        "Spg. 3a": "Visse relationer:\ni) Hvis K2 > K1, så er C(K1) ≥ C(K2).\nii) Hvis K2 > K1 og renten er positiv, så er K2 - K1 ≥ C(K1) - C(K2).\nHint: De ovenstående uligheder er naturligvis knyttet til afkastfunktionerne fi(x) = (x - K1)+ - (x - K2)+ og fii(x) = K2 - K1 - (x - K1)+ + (x - K2)+. Vis (f.eks. med omhyggelige tegninger), at begge er positive, og brug, at arbitr agefri priser er (Q-)forventede diskonterede værdier."
    },
    "Fin1_2017_Aug": {
        "Spg. 1a": "Hvis modellen er arbitragefri og kompleks.",
        "Spg. 1b": "Bestem den arbitrage-fri tid 0-pris for en udløb-2, strike-108 call-option på en aktie.",
        "Spg. 1c": "Angiv sammensætningen af den (aktie, bankbog)-portefølje, der replikerer call-optionen fra spg. 1b.",
        "Spg. 1d": "Beregn de arbitrage-frie tid 0-priser på henholdsvis en europæisk og en amerikansk udløb-2, strike-108 put-option på aktien.",
        "Spg. 1e": "En agent investerer 100 kr. på tid 0 i en selvfinansierende (aktie, bankbog)-portefølje, der holdes indtil tid 2. Dette gøres således, at 50% af porteføljens værdi på et vilkårligt tidspunkt holdes i henholdsvis aktie og bankbog. Angiv hvor mange enheder af aktie og bankbog agenten holder på tid 0 og tid 1 samt de mulige tid 2-værdier af porteføljen.",
        "Spg. 2a": "Beregn de forventede fremtidige korte renter, EQ(τ(t)), for t = 0, 1, 2. Vink: Til EQ(τ(2)) kan man med fordel bruge itererede forventninger/tenedgangsegenskaben.",
        "Spg. 2b": "Vis, at arbitrage-fri nulkuponobligationspriser på tid 0 er givet ved \n(P(0,1);P(0,2);P(0,3)) = (0,9901;0,9794;0,9682):",
        "Spg. 2c": "Angiv en arbitrage-fri værdi ved tiden 0 samt Fisher-Weil-varigheden for en 3-periode annuitet med en kuponrente på 2% og en startkapital på 100.",
        "Spg. 2d": "Hvad er Macaulay-varigheden for annuiteten fra spg. 2c?"
    },
    "Fin1_2021_Aug": {
        "1.a": "Vis, at den ovenstående marked er arbitragefrit og komplett.",
        "1.b": "Beregn den arbitragefri t=0 pris på en put option med strike 100, der udløber efter 2 tidspunkter. Oplys også prisen samt den replikerende porteføljes sammensætning på tidspunkt 0 og tidspunkt 1.",
        "1.c": "Forestil dig nu, at renten er 4% i stedet for 2% per tidsenhed. Konstruer en arbitrageportefølje. Beskriv hvorfor den portefølje, du har lavet, er en arbitrage.",
        "1.d": "Forestil dig nu, at renten, i stedet for at være konstant, udvikler sig stokastisk på samme sandsynlighedsrum som aktiekursen. Rentens udvikling er beskrevet ved følgende træ:\n\n  1aaaaaaaaaaaaaaa0.01\n(=\u001a(0) )!!!!!!!!!!!!!!!\n!!!!!!!!\nXaaaaaaaa0.02\n-0.010.05\n0.015\nt= 0 1 2u\nuu\nuu\nu\n\nBestem hvilket interval skal X ligge i for at modellen er arbitragefri.",
        "1.e": "Ved tagX = 0,005. Beregn værdien af NKO-priserne P(0,1), P(0,2) og P(0,3).",
        "1.f": "Genberegn spørgsmål 1.b, men under antagelse af, at renten er stokastisk som beskrevet ovenfor. Fortsæt med X= 0,005. Kan du forklare, hvorfor prisen på put-optionen er højere end i 1.b?",
        "3.a": "Vurder om markedet er arbitragefrit og komplett.",
        "3.b": "Beregn den globale minimum variance portefølje. Oplys porteføljens vægte samt middelværdi og standardafvigelse på afkasttakten."
    },
    "Fin1_2014_Jun": {
        "Spg. 1a": "Vis at modellen er arbitragefri og komplet. Hvorfor kunne man umiddelbart tro, at dette ikke var tilfældet?",
        "Spg. 1b": "Bestem priserne for europæiske udløb-2, strike-102 call- og put-optioner på aktien ved tid-0. Forklar sammensætningen af en (bankbog, put-option)-portefølje, der replikerer call-optionen.",
        "Spg. 1c": "Prisfastsæt de amerikanske versioner af optionerne fra.",
        "Spg. 2a": "Beregn korrelationen mellem aktiernes afkastsatser. Angiv den effektive randtegn på den/de mandler, du finder passende.\nDet er nyttigt at kende følgende matricer:\nA= [1 1]\n[1 0.02865 0.80867]\n[0.80867 1.069]\nog\n[1 1]A^-1=2\n[35.593 1.3051]\n[21.186 0.1102]\n[14.407 0.19493]\n[5:]",
        "Spg. 2b": "I modellen introduceres nu et risikofrit aktiv med en rente på -0,01 (dvs. -1%). Det antages ikke at påvirke fordelingen af aktiernes afkast. Beregn tangentporteføljen og illustrer grafisk, hvordan det ændrer den effektive rand.",
        "Spg. 2c": "I modellen introduceres nu yderligere et nyt aktiv eller projekt uden at påvirke de \"gamle\" aktiver. Tid-1-betalingen fra dette projekt, X, er stokastisk. Det oplyses, at X har en middelværdi på 1000, en spredning på 500 og en korrelation med tangentporteføljens afkast, der er 0,4. Baseret på CAPM (med antagelse om, at tangentporteføljen er markedsporteføljen), hvad er den kritiske tid-0-pris for, om det nye projekt er attraktivt? (Dette kunne også kaldes en ligevægtspris.)",
        "Spg. 3a": "I en arbitragefri periode-model er en af investeringsmulighederne valuta. Valutakursen Y(t) er det antal \"hjemlig valuta\" (tænk: danske kroner), vi skal betale på tidspunkt t for at få 1 enhed udenlandsk valuta (U.S. dollars, f.eks.). Man kan/skal placere sin udenlandske valuta i en udenlandsk bank, hvor den forrentes med den konstante rente rudl. Den hjemlige rente rh antages også at være konstant. Udled en formel for tid-0 forward-prisen på den udenlandske valuta, hvor forward-kontrakten udløber på tidspunkt T. (I finans-lingo kaldes dette en FX forward; FX for foreign exchange.)\nHint: Dette kan gøres med et carry-argument: Køb 1 enhed valuta for indenlandsk lånte penge, placer i udenlandsk bank, indgå et passende antal forward-kontrakter, og se hvad der sker på tidspunkt T. Formlen bliver \"mere æstetisk\", hvis man opfatter renterne som kontinuert tilskrevne, men det er ikke nødvendigt. Alternativt kan rudlæses som en dividende-rate i en abstrakt udregning."
    },
    "Fin1_2020_Aug": {
        "Spg. 1a": "Beregn den forventede tid til 2. aktiekurs, EP(S(2)).",
        "Spg. 1b": "Vis at modellen er arbitragesikker og fuldkommen.",
        "Spg. 1c": "Betragt en udløb-2, strike-105 call-option på en aktie. Beregn den arbitragefri tid 0-pris på denne. Angiv tid 0-sammensætningen for den replikerende (aktie, bankbog)-portefølje.",
        "Spg. 1d": "En investor investerer ved tidspunkt 0 sin formue på 500 kroner i aktier, og holder strategien selvfinansierende ved at (gen)investere tidspunkt 1-dividender i aktien og sælger sin portefølje ved tidspunkt 2. Hvad er hendes P-forventede formue ved tidspunkt 2? Hvad er den tilsvarende Q-forventning, hvor Q altid betegner en martingal/risikoneutral sandsynlighed.",
        "Spg. 2a": "Er modellen komplet, hvis nulkuponobligationspriserne (naturligt ordnet) på tidspunkt 0 er givet ved (0,9804; 0,9559; 0,9366)?",
        "Spg. 2b": "Betragt en 3-periode annuitetsobligation med hovedstol 100. Hvad skal kuponrenten være for at obligationen har kurs 100 på tid 0 (handler til par)? Hvad er denne obligations varighed (efter en definition, du finder passende)?",
        "Spg. 2c": "Beregn forward-prisen for en forward-kontrakt med udløb på tidspunkt 2 og annuitetsobligationen fra spg. 2b som underliggende; Fwd(0,2) i almindelig notation.",
        "Spg. 2d": "Til hvilken kuponrente vil konverterbare (callable) 3-periode-annuitetsobligationer handle til par på tidspunkt 0?",
        "Spg. 3a": "Nu betragtes en verden med kun to usikre aktiver, hvis afkast-rater har kovariansmatricen\n\n{{σ1^2, ρ1,2σ1σ2},\n{ρ1,2σ1σ2, σ2^2}},\n\nhvor ρ er korrelationen mellem afkast-raterne. De forventede afkast-rater spiller ingen rolle i dette spørgsmål. Vi ser på en portefølje (α1, α2), hvor α1 er andelen investeret i aktiv 1 og derfor α2 = 1-α1. Vis at den værdi af α1, der minimerer porteføljeafkastets varians, er givet ved\n\nα1 = (σ2ρ1,2)/((σ1^2) + (σ2^2) - 2ρ1,2σ1σ2).\n\nLigger α1 altid mellem 0 og 1?"
    },
    "Fin1_2015_Jun": {
        "Spg. 1a": "Vis at modellen er arbitragefri og komplett.\nNu betragtes en udløb-2, strike-100 såkaldt digital (eller binær) option på aktien. Her forstås en kontrakt, der betaler 1 på tid 2, hvis aktiekursen er skarpt større end 100; pay-off er med andre ord (indikatorfunktionsnotation) 1S(2)>100.",
        "Spg. 1b": "Bestem tid-0 prisen på den digitale option. Angiv den initiale sammensætning af den replike-\nrende (aktie, bankbog)-portefølje.\nEt firma tilbyder nu den digitale option i en 'pengene tilbage'-version. Herved forstås, at hvis\naktiekursen ender på samme niveau, som den begyndte, så får optionskøberen sin oprindelige\ninvestering (altså det, han betalte for optionen) tilbage.",
        "Spg. 1c": "Hvad er tid 0-prisen på 'pengene tilbage'-optionen? I en standard binomial model med meget små tidsskridt, hvad er værdien af 'pengene tilbage'-rettigheden?",
        "Spg. 2a": "De givne nulkuponobligationspriser (naturligt ordnet) på tid 0 er:\n\n(0;99010; 0;97554; 0;95374)\n\nSom sådan kan nulkuponrenterne på tid 0 angives.",
        "Spg. 2b": "Angiv betalingsrækken for en 3-årig annuitetsobligation med initial hovedstol på 100 og\nkuponrente 0,015 (1,5%). Hvad er (alt sammen på tid 0) obligationens kurs, effektive rente\nog Macaulay-varighed?",
        "Spg. 2c": "Beregn tid 0-kursen på den konverterbare variant af annuiteten fra spg. 2b. (Ved konverterbar forstås, at låntageren når som helst kan slippe ud af sine fremtidige forpligtelser ved at betale den resterende hovedstol; han kan indfri sit lån før tid; han har en amerikansk option.)",
        "Spg. 3a": "Lad X være en (uendelig) følge af uafhængige og identisk fordelte stokastiske variable, hvor hver X tager værdierne ln 2 (med ln menes den naturlige logaritme) hver med sandsynlighed 1/2. Vi definerer M(0) = 1 og M(t) = t * ∏(i=1 til t) e^Xi+c for t ≥ 1, hvor c er en konstant. (Med notationen ∏ menes 'produkt'.) Vi vil bevise at Et(M(t+1)) = M(t) for alle t ≥ 0, hvor betingningen er mht. X'ernes naturlige filtrering. (Hvis ikke det var fordi, vi kun har defineret martingalitet for endelige følger, så ville vi sige, at M hermed blev en martingal.) Vi vil argumentere for at med det fundne martingal covenfor, vil M(t) → ∞ når t → ∞ næsten sikkert."
    },
    "Fin1_2010_Apr": {
        "Spg. 1a": "Vis, at modellen er arbitragefri og komplet.\nEn såkaldt boosted call er karakteriseret ved et udbetalingstidspunkt (T) og en strike-kurs (K), og den har en udbetaling på 1/2 * (S(T))^2 - K^2, hvis S(T) > K, ellers er udbetalingen 0, på tidspunkt T.",
        "Spg. 1b": "Beregn i den givne 2-periode-model den arbitrage-fri tid-0-pris p på en boosted call med 1K= 400 og T= 2.\n\nAngiv den initiale sammensætning af den (aktie,bankbog)-portefølje, der replikerer den betragtede boosted call.",
        "Spg. 1c": "Vis at i en arbitrage-fri model er prisen på en boosted call (eller lig med) prisen på en almindelig call-option med samme udløbstidspunkt og strike-kurs. (Vink: Sammenlign (tegn!) payoff-funktioner.)",
        "Spg. 2a": "Vis at nulkuponobligationspriserne på tidspunkt 0 er\n(P(0,1); P(0,2); P(0,3)) = (0,9709; 0,9404; 0,9070).",
        "Spg. 2b": "Angiv betalingsrække, tid-0-kurs samt Fisher/Weil-varighed for et 3-periode serielån med 3% kuponrente og en indledende hovedstol på 100.",
        "Spg. 2c": "Et såkaldt udgiftsminimerende serielån med loft har samme afdragsprofil som et almindeligt serielån,\nmen den resterende hovedstol forrentes til enhver tid med minimum af den gældende\nkorte rente og et loft, λ. Eller udtrykt i Nyttes notation\nit=Ht-1 * min(λ,(t-1));\nBeregn tid-0-kursen for udgiftsminimerende serielån med loft = 0.035\"-varianten af lånet fra spg. 2b.\n(Vink: Der erindres om at\nkurs(t-1) = EQ\nt-1\nkurs(t) + dividende(t)\n1 + λ(t-1)\n;\nhvor rollen som \"dividende\" her spilles \"rentebetaling + afdrag\".)",
        "Spg. 3a": "Lad X_j være en følge af uafhængige stokastiske variable (tilpasset en filtrering F), hvorom det gælder at P(X_i=1) = P(X_i=-1) = 1/2. Sæt M(0) = 0 og definer M(t) = t∑(j=1 til T) X_j-1*X_j for 1 ≤ t ≤ T. Vis at M er en martingal (mht. F)."
    },
    "Fin1_2009_Apr": {
        "Spg. 1a": "Vis at vektoren af 1. periode aktieafkastere (under P) har middelværdi\nµ=/bracketleftbigg\n0.07\n0.06/bracketrightbigg\nog kovariansmatrix\nΣ=/bracketleftbigg0.0216 −0.0132\n−0.0132 0.0134/bracketrightbigg.",
        "Spg. 1b": "Vis at (2-period) modellen er arbitragefri og komplet. Vink: (1, 3, 1, 3, 1).\nDer indføres nu en såkaldt bytte-option. Det er en kontrakt, der på tidspunkt 2 giver ret, men ikke pligt, til at bytte (1 enhed af) aktie 1 for (1 enhed af) aktie 2.",
        "Spg. 1c": "Argumenter for, at værdien af en bytteoption på tidspunkt 2, dvs. dens pay-off, er (S2(2) - S1(2)), og bestem dens arbitragefrie pris på tidspunkt 0.",
        "Spg. 1d": "Beregn sammensætningen på tidspunkt 0 af den portefølje eller handelsstrategi, der replikerer bytte-optionen.",
        "Spg. 2a": "Bestem tangentporteføljens sammensætning og angiv på den/de måde(r), du finder passende, den eﬃciente rand og the capital market line. Tip: Det kan være nyttigt at vide, at Σ−1(µ−0.05×1) = (3 .4722,4.1667)⊤.",
        "Spg. 2b": "Undersøg og kommenter om CAPM-relationen holder for aktie 1 når en portefølje, der har lige vægte i aktie 1, aktie 2 og det risikofrie aktiv (altså w= (1/3,1/3,1/3) ) bruges som referenceportefølje, eller \"kandidat til markedsportefølje\" eller kort og godt \"på højresiden\".",
        "Spg. 3a": "Vis at den arbitragefri tid-0 pris på en 3-årig annuitetsobligation med en kuponsats på 0,04 (altså 4%) og en initial hovedstad på 100 er 99,96.",
        "Spg. 3b": "Beregn - med en passende definition - varigheden af annuitetsobligationen fra spg. 3a. 3.",
        "Spg. 3c": "Betragt en forward- (eller termins)kontrakt på en annuitetsobligationen fra spg. 3a og 3b.\nAntag at denne forwardkontrakt udløber på tidspunkt 2. Beregn dens tid-0 forwardpris,\naltså F(0,2) medNoternes notation."
    },
    "Fin1_2023_Jun": {
        "1.1": "Vurder (a) om markedet er arbitragefrit, og (b) om markedet er komplet.",
        "1.2": "Beregn prisen på en udløb T=2, put-option med strikprisen K=105. Angiv den replikerede porteføljes sammensætning på t=0.",
        "1.3": "Betragt nu en futureskontrakt på den underliggende aktie med udløb T=2. Beregn futuresprisen på aktien (Fut(0,2)) på tidspunktet t=0.",
        "1.5": "Beregne prisen på en såkaldt futures-call med udløb T = 1 time, hvor den underliggende er futureskontrakten fra det tidligere spørgsmål. Med andre ord, en call option der betaler (Fut(1,2) - K)+ på tidspunkt t = 1. Antag igen at K = 105.",
        "1.6": "Kan du replicere optionen fra det forrige spørgsmål ved at indgå i forward kontrakter (på den underliggende aktie, med udløb T=2) og handle det risikofri aktiv? Hvis ja, forklar hvorfor og angiv porteføljens sammensætning på tid t=0. Antag som altid, at forward kontrakter indgås med en initial pris på nul.",
        "2.1": "Vurdér (a) om markedet er arbitragefrit, og (b) om markedet er komplet.",
        "2.2": "Du får nu at vide, at der eksisterer en risikofri aktiv på markedet. I hvilket interval kan den risikofri rente ligge, hvis markedet skal forblive arbitragefrit?",
        "2.3": "Du får nu at vide, at M er markedsporteføljen som defineret i CAPM-modellen. S er et aktiv ud af potentielt mange andre aktiver i markedet. Hvis S er prisfastsat korrekt ifølge CAPM-modellen, hvad er så den risikofrie rente i markedet?",
        "2.4": "Uagtet dit svar i det forrige spørgsmål. Hvis du sætter den risikofri rente til at være µ0= 0.01, er det så et godt eller dårligt køb (eller ingen af delene) ifølge CAPM? Konstruer en betaneutral (men ikke dollarneutral) portefølje P bestående af det risikofri aktiv, markedsporteføljen og S, som har en standardafvigelse på dets afkastrate på σP= 0.1 og positiv forventet afkastrate. Oplys den forventede afkastrate på P samt porteføljens vægte."
    },
    "Fin1_2006_Aug": {
        "1.a": "Vis at modellen er arbitragefri og komplet.\nBeregn de arbitragefri priser på følgende fire aktiver/kontrakter:\n- Europæiske call-optioner med strike (K) på 105 og udløbstider henholdsvis 1 og 2.\n- Europæiske put-optioner med strike (K) på 105 og udløbstider henholdsvis 1 og 2.",
        "1.b": "Beregn de arbitragefrie priser på amerikanske udløb-2, strejke-105 put- og call-optioner.\nKommenter kort.",
        "1.c": "Hvordan replikeres (eller \"hedges\", afhængig af fortegnet) udløb-1, strike-105 call-optionen med aktien og bankbogen? (En beregning ønskes foretaget.)\n\nKan pay-off'et fra udløb-2, strike-105 call-optionen (S(2)-105)+, replikeres med udløb-2, strike-105 put-optionen og bankbogen?",
        "2.a": "Vis at de arbitragefri tid-0 nulkuponobligationspriser (\"zero-coupon bond prices\") er (1, 0.95238, 0.90711, 0.86403).\nBeregn de tilhørende nulkuponrenter (\"zero-coupon yields\") og forward-renter (\"f(0, t)\" iNoternes notation).\n22.b\nNu betragtes to 3-årig obligationer med kuponrente på 5% og hovedstol på 100. Den ene er et serielån, den anden en annuitet.\nHvad er tid-0 kurserne på de to obligationer?\nHvad er den effektive rente på serielånet? (Uden nogen form for beregning kan du give et ganske præcist svar.)\nBeregn de to obligationers varigheder efter en definition, du finder passende. Hvilken er størst, og hvorfor er det ikke overraskende?\nHvad er værdien af serielånets resterende betalinger i tid -1 op-knuden (altså når den korte rente er 6%)? Hvad ville der stå i avisens kursliste?",
        "3.a": "Der erindres om følgende to ting:\n• En funktion f: R^n -> R kaldes homogen af 1. grad, hvis f(λx) = λf(x) for alle λ ∈ R+ (et positivt reelt tal) og for alle x.\n• Eulers sætning siger, at en funktion er homogen af 1. grad hvis og kun hvis den har formen\nf(x) = ∑(i=1)^n xi * ∂f/∂xi(x).\nVis at Black/Scholes' call-optionspriser er homogene af 1. grad i S (aktiekurs, \"spot\", nogle gange kaldet S0) og K (strike), altså at\nCall(λS, λK, . . . ) = λCall(S, K, . . . ).\nVis at ∂Call/∂S = Φ(d1),\nhvor alt er som i noterne, dvs. d1 = (ln(S/K) + (r+σ^2/2)T)/(σ√T).\nVink: For at tjekke om ens argumentation holder vand, kan man overveje hvorfor dette resultat er \"mindre oplagt end det ser ud\". Hvad skal man huske, hvis man med ret kraft differentierer Black/Scholes' formel mht. S?"
    },
    "Fin1_2017_Jun": {
        "Spg. 1a": "Den viste model er arbitrage-fri og komplet. \nHint: Tilstandspriser.",
        "Spg. 1b": "Hvordan konstrueres et risikofrit aktiv i hver 1-periode delmodel, og hvad er de tilhørende renter? Hvordan ser rentestrukturen ud på tidspunkt 0 i den fulde model (dvs. nulkuponobligationspriserne P(0;t) eller nulkuponrenterne y(0;t))?",
        "Spg. 1c": "Beregn de arbitrage-frie tid 0-priser på udløb-2, strike-100 call-optioner på aktie 1 og\npå aktie 2.",
        "Spg. 1d": "Angiv, hvordan aktie 1's call-option fra spg. 1c kan replikeres ved hjælp af aktie 2 og en anden passende aktiv.",
        "Spg. 1e": "Nu betragtes tre call-lignende optioner givet ved deres tid-2-udbetaling, X, Y og Z:\n\nX = max(S1(2)-100, 0) + max(S2(2)-100, 0)\nY = max(S1(2), S2(2)) - 100\nZ = max(S1(1), S1(2), S2(1), S2(2)) - 100\n\nBeregn arbitrage-fri tid-0-priser på disse tre optioner og diskuter forskelle og ligheder både internt mellem de tre nye optioner og i forhold til de almindelige call-optioner fra spg. 1c.",
        "Spg. 2a": "Bestem de forventede afkasttænger for aktierne og bekræft, at spredningen af ​​afkasttængerne for aktie A3 er 0,204. Beregn også korrelationen mellem afkasttængerne for A1 og A2.",
        "Spg. 2b": "De tre aktier antages nu at indgå i et standard middelværdi-varians-porteføljevalgsproblem; også kaldet et Markowitz-problem eller en Markowitz-analyse. Angiv den effektive rand.\nVink: Det kan være nyttigt at vide, at\nA = [1, 1]\n    [1, 1] = [0.47467, 19.654]\n                      [19.654, 1073.6]\n                      :\n2",
        "Spg. 2c": "Vi betragter stadig middelværdi-varians-optimerende investorer, men forestiller os nu,\nat de er underlagt følgende restriktion: De kan højst investere i to af de tre aktier; en\ngivet investor må dog selv bestemme hvilke to.\nBeskriv hvordan den effektive rand nu kan findes og ser ud, idet der med effektiv rand\nsom sædvanlig menes sammenhængen mellem krævet forventet afkastrate og den mindst\nmulige spredning (eller varians) på afkasttakten. Angiv den optimale portefølje, der har\nen forventet afkastrate på 0.06 (dvs. 6%).\nVink: Start gerne kvalitativt/grafisk. En fuldt kvantitativ analyse kræver, at hele \u0006-\nmatricen beregnes { som under spg. 2a."
    },
    "Fin1_2007_Apr_svar_addendum": {},
    "Fin1_2022_Aug": {
        "Spg. 1a": "Vis, at modellen er fri for arbitrage og komplet.",
        "Spg. 1b": "Betragt en europæisk udløbs 2-put-option på aktien med en strikekurs på 100. Hvad er den arbitragefrie tid-0 pris på denne put-option? Beregn den replikerende portefølje (bestående af aktie og bankbog) for put-optionen.",
        "Spg. 1c": "Beregn prisen på den amerikanske version af put-optionen fra spg. 1b. Forklar hvorfor den er den samme som prisen på den europæiske put-option.",
        "Spg. 1d": "Betragt europæiske 2-put-optioner på aktien med henholdsvis en strikekurs på 110 og 90. Hvad er de arbitragefrie tid 0-priser på de to put-optioner? Gennemsnittet af de to put-optionspriser er større end put-optionsprisen fra spørgsmål 1b. Forklar hvorfor.",
        "Spg. 1e": "Ved den standard binomiale model (med et tidsinterval af længden 1 og givet S(0) og r) betragtes (i denne opgave) en model, hvor St+1=Stexp(±σ), hvor σ kaldes volatilitetsparameteren for modellen.\nFor en given observeret europæisk put-optionens pris defineres den implicitte volatilitet for optionen som den værdi af σ, som gør prisen i den standard binomiale model lig med den observerede optionspris. (Konceptuelt præcis som i Black-Scholes-modellen.)\n1. Beregn den implicite volatilitet for put-optionen fra spg. 1b. Forklar hvorfor denne er forskellig fra de implicite volatiliteter for put-optionerne fra spg. 1d.",
        "Spg. 2a": "Betragt porteføljen givet ved x1/3 = (1/3, 1/3, 1/3)⊤. Beregn x1/3-porteføljens afkast rate middelværdi (µ1/3), afkast ratens spredning (σ1/3), samt afkast ratens korrelation med aktie 2's afkast rate.",
        "Spg. 2b": "Betragt følgende optimeringsproblem:\nmax\nx∈R3x⊤µ under bibetingelserne x⊤1= 1 og x⊤Σx≤σ2\n1/3.\nForklar den finansielle fortolkning af optimeringsproblemet.\nVerificer at den optimale værdi af kriteriefunktionen i optimeringsproblemet er 0,05898. Hvilken x-vektor svarer dette til?",
        "Spg. 2c": "Modellen udvides nu med et risikofrit aktiv med en rente på r0= 0,02 (dvs. 2%).\nAngiv tangentporteføljen.\nAntag at tangentporteføljen er markedsporteføljen. Verificer at CAPM-ligningen holder for x1/3-porteføljen.",
        "Spg. 3a": "Verificer at P10j=1 P(0, i) = 7,0196. (Den størrelse kaldes en annuitetsfaktor eller the present value of a basis point.)\n\nSkitser nulkupon- og forward-rentekurver for helårlige løbetider mellem 1 og 10 år. For hvilken løbetid er forwardrenten maksimal?"
    },
    "Fin1_2014_Aug": {
        "Spg. 1a": "Vis at modellen er fri for arbitrage og komplet.",
        "Spg. 1b": "Betragt en såkaldt Shiller-kontrakt, der på tid 2 udbetaler (d1 + d2)/2, altså aktiens (tidsgennemsnitlige) dividendeudbetalinger. Beregn den arbitragefrie tid-0-pris på Shiller-kontrakten. (Vink: Tegn en graf. Navnet Shiller er ikke tilfældigt valgt, men det er en anden historie.)",
        "Spg. 1c": "Hvordan replikeres Shiller-kontrakten fra spørgsmål 1b?",
        "Spg. 2a": "Vis at nulkuponobligationspriserne på tidspunktet 0 er\n(P(0,1);P(0,2);P(0,3)) = (0,9709; 0,9409; 0,9122):\nBestem nulkuponrenter og (1-periode-)forwardrenter på tidspunktet 0.",
        "Spg. 2b": "Betragt en 3-periode-annuitetsobligation med kuponrente 0,03 (altså 3%) og hovedstol 100.\nAngiv betalingsrækken for denne obligation samt kurs og varighed (sidstnævnte med en passende definition) for tid 0.",
        "Spg. 2c": "Beregn tid-0 kursen på den konverterbare version af obligationen fra spg. 2b. (Konverterbar betyder, at sælgeren af obligationen antager, at han/hun på ethvert tidspunkt kan slippe ud af sine forpligtelser ved at betale den resterende hovedstol. Med andre ord har sælgeren en amerikansk call-option på den inkonverterbare obligation, hvor optionen har en strike-kurs, der varierer over tid og er lig med den resterende hovedstol.)",
        "Spg. 3a": "Forklaring af to-fondsseparation. Man kan stille sig selv følgende spørgsmål: Hvad er det? Hvorfor er det ikke åbenlyst? Hvordan bevises det? Hvor bruges det? Et passende svar kan gives på en halv til en hel side."
    },
    "Fin1_2021_Jun": {
        "1.a": "Opstil betalingsrækkerne for de tre obligationer og vis at nulkuponpriserne (diskonteringsfaktorerne) er givet ved (P(0;1);P(0;2);P(0;3)) = (0,980392;0,961261;0,941227).",
        "1.b": "Forestil dig, at du har en forpligtelse, hvor du skal betale 100, 120 og 105 på tidspunkt 1, 2 og 3. Beregn, hvor mange enheder af de tre obligationer, der skal købes/sælges på tidspunkt-0 for at kunne møde forpligtelsen.",
        "1.c": "I det nævnte marked har vi en fantastisk kortrente1fg.\nTil t=0 beskrev vi nedestående træ; den indeholder som sædvanlig tidspunkter, niveauer og (betingede) sandsynligheder. Sandsynlighederne antages at være risikoneutrale, altså at afspejle et martingalmål (Q). Betragt nu en put option på nulkuponobligationen med udløb tid-3, der betaler (0:98 P(2;3)) + på tid-2. Beregn tid-0 prisen på denne option.\n1Bemærk at vi har kunnet ignorere stokastikken fordi vi alene har behandlet deterministiske betalinger i 1.a og 1.b\n1aaaaaaaaaaaaaaa0.02\n(=\u001a(0) )0.5\n0.5!!!!!!!!!!!!!!!\n!!!!!!!!\n0.010.4\n0.6aaaaaaaa0.030.6\n0.4\n-0.010.05\n0.025\nt= 0 1 2u\nuu\nuu\nu",
        "1.d": "Lad F være den stokastiske proces, der beskriver prisudviklingen for serielånet beskrevet i tabellen ovenfor. Betragt yderligere en put-option, der betaler (33:5 * F(t=2)) på tid-2. Beregn tid-0 prisen på denne option.",
        "1.e": "Betragt nu i stedet en version af serieobligationen, som kan indfries af låntageren (dvs. udstederen) ved at tilbagebetale den resterende gæld/hovedstol (eller sagt på en anden måde, som kan indfries til kurs 100) på tidspunkterne 0, 1 og 2. Beregn prisen på tidspunkt 0 for denne obligation og noter hvilke scenarier, hvor låntageren indfrier obligationen.",
        "2.a": "Vis at markedet er arbitragefrit og komplet.",
        "2.b": "Beregn prisen på en europæisk put med en strikepris på 96, med udløb om 1, med aktiv 1 som det underliggende aktiv.",
        "2.c": "Beregn den risikofri rente.",
        "2.d": "En taget i betragtning at der introduceres en ikke-bindende option med udløb på tid-1 med prisen ~P(0;1) = 0.99 . Konstruer en arbitrageportefølje der har en tid-0 pris på 0.",
        "3.a": "Beregn vægtene i den globale minimum varians portefølje. Oplys desuden den forventede afkastrate og standardafvigelsen på afkasten. (hint: jeg får σgmv= 0.064854)",
        "3.b": "Ydermere får du at vide, at der eksisterer et risikofrit aktiv med afkast på 0,02. Beregn porteføljevægte og standardafvigelse på en effektiv portefølje med en forventet afkast på 0,12."
    },
    "Fin1_2015_Aug": {
        "Spg. 1a": "Er modellen arbitragefri? Er modellen komplet?",
        "Spg. 1b": "Nu betragtes en udløb-2, strike-100 call-option på aktien. Beregn den arbitragefri tid 0-pris på denne. Angiv den initielle sammensætning af den replikerende (aktie, bankbog)-portefølje.",
        "Spg. 1c": "Analyser prisfastsættelse og replikation, hvis der i stedet betragtes en udløb-3, strike-100-call-option.",
        "Spg. 1d": "Analyser prisfastsættelse og replikation, hvis der i stedet betragtes en udløb-3, strike-100 put-option.",
        "Spg. 1e": "Analyser prisfastsættelse og replikation af en udløbende call-option med en strike-pris på 64.",
        "Spg. 2a": "De givne nulpunktsobligationspriser (i naturlig orden) på tidspunktet 0 er (0.97087, 0.93824, 0.89603). Fastlæg nulkupon- og fremtidsrenterne på tidspunktet 0.",
        "Spg. 2b": "Angiv amortiseringsprofilen (dvs. betalingsrækken delt op i ydelser (yt), rentebetalinger (it) samt afdrag (dt) og resterende hovedstol (Ht)) for en 3-årig annuitetsobligation med en initial hovedstol på 100 og en kuponrente på 0,03 (3%).",
        "Spg. 2c": "Hvad skal kuponrenten være for at en annuitetsobligation som i spg. 2b har en tids-mæssig pris på 100 (dvs. \"den handles til pari\")?",
        "Spg. 2d": "Nu betragtes en forwardkontrakt med annuiteten fra spg. 2b som underliggende aktiv. Forwardkontrakten udløber på tid T = 1 (i almindeligt anvendt notation). Beregn den initiale forwardpris, Fwd(0 ;T)."
    },
    "Fin1_2020_Jun": {
        "Spg. 1a": "Vis, at modellen er arbitragefri og inkomplet.",
        "Spg. 1b": "Beregn tiden 0-forwardprisen (Fwd(0;2)) for en forwardkontrakt med udløb på tid 2 (og aktien som underliggende).",
        "Spg. 1c": "Betragt en udløb-2, strike-108 put option på aktien. Argumenter for, at denne har den entydige arbitragefri tid 0-pris 6.9388.",
        "Spg. 1d": "Forklar hvordan analysen fra spg. 1c ændres, hvis vi i stedet betragter en putoption med en strike på 110. Er 6.9388 en mulig arbitragefri tid 0 pris for denne?",
        "Spg. 2a": "De naturligt ordnede priser på nulkuponobligationer på tidspunkt 0 er givet ved (0,9524; 0,9028; 0,8576).",
        "Spg. 2b": "Angiv amortiseringsprofilen (dvs. betalingsrækken delt op i ydelser (yt) og resterende hovedstol (Ht)) for et 3-årigt stående lån med en initial hovedstol på 100 og kuponrente på 0,04 (4%). Beregn (for tid 0) kurs, effektiv rente og varighed for det stående lån (sidstnævnte efter en definition, du finder passende).",
        "Spg. 2c": "Beregn tid 0-kursen på den konverterbare variant af det stående lån fra spg. 2b. (Konverterbar betyder, at låntager på et hvilket som helst tidspunkt kan slippe ud af sine fremtidige forpligtelser ved at betale den resterende hovedstol; en callable bond som i noternes afsnit 8.3)",
        "Spg. 2d": "Vi betragter nu to låntagere, A og B, der optager et lån på tidspunkt 0. (Det kunne være andelsforeninger, men det er ligegyldigt her). Begge optager lån, dvs. udsteder/sælger obligationer, således at deres tid 0-provenu er 100, dvs. de får begge 100 i hånden på tidspunkt 0. Låntager A gør det med det (inkonvertible) stående lån fra spg. 2b, mens låntager B bruger den konvertible obligation fra spg. 2c. Hvor mange obligationer skal de hver især sælge, og hvad er deres ydelse på lånet efter 1 år? Antag nu, at renten mellem tid 0 og tid 1 falder, dvs. vi står i (tid 1, ned)-knuden. Hvad er, for hhv. A og B, markedsværdien af deres gæld, dvs. den samlede værdi af de solgte obligationer? Kommenter resultaterne.",
        "Spg. 3a": "Vis at hvis aktivernes afkastrates er perfekt korrelerede (ρ = 1) så er spredningen pα porteføljens afkastrate, lad os kalde sidstnævnte σ. (Vink: Husk hvordan kvadratet på en to-ledet størrelse ser ud.)\nUdsagnet er essentielt \"hvis og kun hvis\", og når vi kun ser på positive vægte, så har vi at for ρ < 1 er σ mindre end z. (Dette ønskes ikke bevist.) Det motiverer, at man kalder σ for porteføjens diversifikationsgevinst."
    },
    "Fin1_2016_Jun": {
        "1.a": "Vis, at de følgende tekst er korrekt: \nVis, at de nul-kupon obligationspriser på tidspunkt 0 er givet ved \nP(0;1);P(0;2);P(0;3)\u0001\n= (0;96154; 0;92464; 0;88446)\nOg angiv nulkupon og forwardrenter på tidspunkt 0.",
        "1.b": "Betragt nu en call option på en prisfastsættelse af obligationen, der betaler (P(2;3) × 0,93) på tidspunkt 2. Beregn prisen på denne option ved tidspunkt 0.",
        "1.c": "Lad n være antallet af aktiver.\nLad 0b betegne prisen på en generel opkaldsoption på en n-udløbsobligation med betaling på tidspunkt t som (P(t;T) - K)+. Lad tilsvarende 0v være prisen på en put-option med betaling (K - P(t;T))+ på tidspunkt t. Bevis følgende påstand:\nP(0;T) - K*P(0;t) = 0b - 0v\n\n11. Lad nu prisen for en put-option, der betaler (0.93*P(2;3))+ på tidspunkt 2, være 0.01 kr. Brug den afledte relation fra det tidligere spørgsmål til at konstruere en arbitragestrategi bestående af put'en, call'en (fra tidligere spørgsmål), samt to passende n-udløbsobligationer. Angiv hvor meget du køber og sælger af hvert aktiv. Argumenter for at strategien er en arbitrage ved at beregne alle mulige cash-flows for strategien på tidspunkt 0, 1, 2 og 3.",
        "1.e": "Betragt en stående (bullet) obligation med initial hovedstol F, kuponrente R og udløb på tidspunkt T. Antag obligationen har betalinger på tidspunkter 1;:::;T . Prisen for denne obligation på tid- t betegnes Pb(t;T) . Lad callb\n0 og putb\n0 være tid-0 call og put priser på kontrakter der betaler hhv. (Pb(t;T)\u0000K)+ og (K\u0000Pb(t;T))+ på tid t. Vis:\nPb(0;T) = FRtX\ni=1 P(0;i) K P(0;t) = callb\n0 putb\n0.",
        "2.a": "Holder CAPM i denne markedsøkonomi? Begrund dit svar.",
        "2.b": "Du arbejder i Low Risk-afdelingen i en kapitalfond, og alle dine positioner må maksimalt have 10% standardafvigelse og ingen markedsrisiko (=0). Din chef øjner en 'fed' investeringsmulighed. Hun har observeret, at Y har en højere forventet afkast end X, og derfor siger hun: konstruer en portefølje P bestående af X, Y samt det risikofri aktiv, hvor du 1) er lang (har positiv porteføljevægt) i Y og kort (har negativ porteføljevægt) i X og 2) ingen systematisk risiko har (dvs. P = 0) samt 3) at standardafvigelsen på porteføljens afkast er σP=0,1. Beregn porteføljens vægte i X, Y og det risikofre aktiv samt dens forventede afkast, μP, på denne portefølje. Er dette en god investering? Begrund dit svar.",
        "2.c": "Foreslå en portefølje, der opfylder krav nr. 2) og 3), men ikke nødvendigvis krav nr. 1) fra det forrige spørgsmål, som du mener vil være en bedre investering. Beregn den forventede afkastrate for denne portefølje."
    },
    "Fin1_2023_Aug": {
        "1.1": "Anvendende taget ρ0= 0.05ρ1,u= 0.07 og ρ1,d= 0.04 , beregnet nogle opadskuende priser P(0,1) , P(0,2) .",
        "1.2": "Beregn prisen på en call option med udløb på tidspunkt t=1h, hvor den underliggende er en nulkuponobligation med udløb på tid t=2. Den betaler således (P(1,2) - K)+, hvor K=0.94 på tidspunkt t=1. Angiv den initielle sammensætning af den replikerende portefølje. Brug samme antagelser som forrige spørgsmål.",
        "1.3": "Vis det generelle udsagn\nσ1 = q\nVær Q[ln(ρ1)] = 1\n2ln(ρ1,u)\nρ1,d",
        "1.4": "Bestem ρ0, ρ1, u og ρ1,d under antagelse af P(0,1) = 0.938967, P(0,2) = 0.88345 og σ1 = 0.209355.",
        "1.5": "Bestem ρ0, ρ1, u og ρd under antagelse af P(0,1) = 0.938967, P(0,2) = 0.886134, og C0 = 0.010112. Her er C0 prisen på call optionen beskrevet i spørgsmål 1.2.",
        "2.1": "Holder CAPM i dette marked?",
        "2.2": "Beregn den globale minimale variansportefølje, hvor der kun investeres i de risikable investeringer. Antag her, at single index modellen kan beskrive de fire risikable investeringer. Oplys porteføljens vægte.",
        "2.3": "Konstruer en portefølje med den mindst mulige varians og en alpha på 0,05. Brug kun de 4 risikable aktiver. Angiv porteføljens vægte, forventet afkast og standardafvigelse.",
        "3.1": "En tag A er en minimumvariansportefølje, og B er en portefølje med samme forventede afkast. Antag at der ikke eksisterer et risikofrit aktiv. Vis at Cov[rA, rB] = Var[rA].",
        "3.2": "En tag CAPM holder i et marked. S angiver en vilkårlig årlig aktiekurs og M angiver kursen på markedets portefølje. Vis at følgende relation gælder:\nS0=1\n1 +µ0(E[S1]−Cov[S1, M1])\nVar[M1](E[M1]−M0(1 +µ0))"
    },
    "MatFin1_2019_Okt": {
        "Spg. 1a": "Beregn den forventede aktieafkast over det første år, EP((S1-S0)/S0). Beregn også afkastets spredning. Hvordan forholder disse tal sig til modelparametrene β og α?",
        "Spg. 1b": "En digital (også kaldet binær) option med strejkepris K og udløbstidspunkt T betaler 1 kr. på tidspunkt T, hvis aktiekursen på tidspunkt T er større end K, og 0 ellers. Beregn arbitragefrie priser for T=1-digital-optioner med K=70 og K=110. Find den replikerende (aktie, bankbog)-strategi for K=110-digital-optionen.",
        "Spg. 1c": "Antag at prisen ændres til 0:3. Beregn de nye priser på digital-optionerne fra spg. 1b. Kommenter.",
        "Spg. 1d": "Vi er nu tilbage i 0-2-modellen, men antager, at det kun er muligt at handle med aktier og det risikofrie aktiv på tidspunkt 0. Bestem det arbitragefrie prisinterval for T=1 og K=110 for digital-optionen.",
        "Spg. 2a": "Visat nulkuponobligationspriserne på tid 0 er (P(0;1);P(0;2);P(0;3)) = (0,9804; 0,9637; 0,9398).\nBeregn nulkuponrenterne.",
        "Spg. 2b": "Betragt en 3-periode annuitetsobligation med en hovedstol på 100 og en kuponrente på 0,03 (3%). Beregn kursen på denne obligation. Ved hvilken kuponrente vil obligationens kurs være 100, hvilket betyder, at den handles til pari?",
        "Spg. 2c": "Beregn forwardprisen for en forwardkontrakt med udløb på tidspunkt 1 på en af de to obligationer fra spg. 2b. Hvad er den tilsvarende futurespris?",
        "Spg. 2d": "Beregn prisen på den konverterbare variant af par-obligationen fra spg. 2b. (Dette er tilfældet, hvor låntageren kan slippe ud af sine fremtidige forpligtelser ved at betale den resterende hovedstol.)",
        "Spg. 2e": "En andelsboligforening har en variabelt forrentet gæld med en hovedstol på 50 millioner kroner.\nForeningen ønsker at omlægge til et fastforrentet lån. Diskuter fordele og ulemper/risici ved\nat gøre det med de forskellige obligationer fra spg. 2b og 2d."
    },
    "MatFin1_2022_nov": {
        "Spg. 1a": "Hvad er α og σ? Beregn EP(S2) og varP(S2).\nAntag i det følgende r = 0,04 (dvs. renten er 4% pr. periode).",
        "Spg. 1b": "Beregn arbitragefri tid 0-priser på europæiske put-optioner med henholdsvis (T=3, K=100), (T=3, K=90) og (T=2, K=100), hvor T er udløb og K er strike. Tip: Den første pris er 10,463 og den sidste er 10,820.",
        "Spg. 1c": "Bestem den aktie-portefølje, der replikerer den europæiske (T=3, K=100)-put-option.",
        "Spg. 1d": "Beregn prisen på en amerikansk (T= 3, K= 100) put-option og angiv den optimale indfrielsesstrategi.",
        "Spg. 1e": "Antag at der kun kan handles på tidspunkt 0, og at den europæiske (T=3, K=100)-putoption prissættes til 10,463. Hvad er det arbitragefri prisinterval for den europæiske (T=3, K=90)-putoption? (Husk at det risikofrie aktiv med en løbetid på 3 perioder har en slutbetaling på (1+r)3.) Hvorfor har den europæiske (T=2, K=100)-putoption stadig en entydig arbitragefri pris på 10,820?",
        "Spg. 2a": "Vis at nulkuponobligationspriser (naturligt ordnede) på tid 0 er givet ved (0,9804; 0,9491; 0,9173). Er modellen komplett?",
        "Spg. 3b": "Betragt en 3-periode-annuitetsobligation med en hovedstol på 100. Hvad skal kuponrenten være for, at obligationen har en kurs på 100 på tidspunkt 0 (handler til pari)?",
        "Spg. 2c": "Beregn udløbs 2-forward- og futurespriser på annuitetsobligationen fra spg. 2b på tid 0 – altså henholdsvis Fwd(0; 2) og Fut(0; 2).",
        "Spg. 3a": "Vis at markedet er arbitragefrit hvis og kun hvis\n\\( \\frac{1}{xA} + \\frac{1}{xB} = \\frac{1}{1 + r} \\)"
    },
    "MatFin1_2016_Nov": {
        "Spg. 1a": "Vis, at dette er et specialtilfælde af standardbinomialmodellen og, at modellen er arbitragefri\nog komplet.",
        "Spg. 1b": "Fastlæg tid-0 priser på europæiske strike-110, udløb-3 call- og put-optioner på aktien.",
        "Spg. 1c": "Forklar, hvordan den replikerende portefølje for call-optionen fra spørgsmål 1b konstrueres.",
        "Spg. 1d": "Hvad er prisen på de amerikanske optioner ved tidspunkt 0, som nævnt i spørgsmål 1b?",
        "Spg. 1e": "Nu betragtes en såkaldt realized variance-kontrakt, som er en kontrakt, der på tid 3 betaler RV(3) = 1/33 * Σ(t=1 to 3) (Δ(t))^2; \nhvor Δ(t) er de kvadrerede afkasttakter, dvs. Δ(t) = (S(t) - S(t-1))/S(t-1). Beregn 0-prisen på realized variance-kontrakten. Vink: Vis og brug at Δ'erne er identisk fordelte.",
        "Spg. 2a": "Antag at det kun er muligt at handle på tidspunkterne 0 og 3. Angiv det interval uden arbitrage for prisen på en call-option på tidspunkt 0.",
        "Spg. 2b": "Antag i stedet, at det er muligt at handle på tid 0, 1 og 3, men stadig ikke på tid 2. Forklar, hvordan du ville kunne beregne et arbitragefrit prisinterval. Hvad kan du sige om prisintervallets endepunkter i forhold til beregningerne i spg. 1b og 2a?",
        "Spg. 3a": "De nulkuponobligationspriser (naturligt ordnede) ved tid 0 er angivet som\n(0,9709; 0,9381; 0,9067).",
        "Spg. 3b": "Angiv amortiseringsprofilen for en 3-årig annuitetsobligation med en startkapital på 100 og en rentesats på 0,03 (3%); ved amortiseringsprofilen forstås, at betalingen (y), rentebetalingen (r), afdraget (a) og resterende hovedsaldo (H) angives for alle relevante tidspunkter. Hvad er obligationens tid 0-kurs?",
        "Spg. 3c": "Betragt nu en forwardkontrakt med annuitetsobligationen fra spg. 3b som underliggende aktiv. Forwardkontrakten udløber på tidspunkt 1. Angiv tidspunkt 0-forwardprisen.",
        "Spg. 3d": "Nu indføres en såkaldt ydende annuitet. Herved forstås en obligation, der har samme afdragsprofil som obligationen fra spg. 3b, men for hvilken tid t-rentebetalingen er Rt-1Ht-1, hvor Rt er den korte rente og H er den resterende hovedstol for obligationen fra spg. 3b. Vis, at den ydende annuitets kurs altid er lig med den resterende hovedstol, dvs. at den handler til par. (Dette kan gøres med bogstaver ved induktion baglæns eller i en snæver vending med tal.)",
        "Spg. 4a": "Lad X være en stokastisk variabel på et endeligt, filtreret sandsynlighedsrum, altså standard set-up'et fra kapitel 5 i Lando, Nielsen og Poulsen-noterne.\nSæt M1(t) = E[t(X)] for 0 ≤ t ≤ T. Er M1 en martingal?\nSæt M2(t) = (M1(t))^2 for 0 ≤ t ≤ T. Er M2 en martingal?\nSæt M3(t) = E[t(X^2)] for 0 ≤ t ≤ T. Er M3 en martingal?"
    },
    "MatFin1_2021_nov": {
        "Spg. 1a": "Vismodellen er fri for arbitrage og komplet.",
        "Spg. 1b": "Betragt europæiske udløb 2-call-optioner på aktien med strikekurser henholdsvis 95 og 105. Hvad er de arbitragefrie tid 0-priser på de to optioner? Beregn den replikerende (aktie, bankbog)-portefølje for en af optionerne.",
        "Spg. 1c": "En asiatisk call-option på aktien har følgende pay-off på tidspunkt 2:\nX(2) = 1/32*Xt=0S(t)ΔK!+: Beregn den arbitrærfrie pris på den asiatiske call-option med strike K=105. Den er lavere end prisen for den tilsvarende europæiske call-option fra spgs. 1b. Er det overraskende? Ved standard binomial modellen (med tidsskridt af længde 1 og givet S(0) og r) forstår man (i denne opgave) en model, hvor St+1=St*exp(σ), hvor σ kaldes for modellens volatilitetsparameter. For en given observeret europæisk call-optionspris definerer vi optionens implicitte volatilitet som den værdi af σ, der gør, at prisen i standard binomialmodellen er lig med den observerede optionspris. (Konceptuelt præcis som for Black-Scholes-modellen.)",
        "Spg. 1d": "Beregn de impliikeede volatiliteter for de to call-optionspriser fra spg. 1b. Er modellen givet i starten af denne opgave et specialtilfælde af standard binomialmodellen?",
        "Spg. 2a": "Betragt et activ, der på tid 1 udbetaler B. Angiv intervallet af arbitragefrie tid 0-priser for dette aktiv.",
        "Spg. 2b": "Dividende-vektoren ovenfor er konstrueret med formlen \u000e=a+bD+cD^2, hvor a= 1, b= 0.01 og c= 0.0001. Antag i stedet at a= 1, b= 0.02 og c= 0. Angiv intervallet af arbitragefrie tid 0-priser for aktivet, der udbetaler \u000e, og kommenter resultatet.",
        "Spg. 3a": "Vises at priserne for nulkuponobligationer (naturligt ordnet) på tidspunkt 0 er givet ved (0,9524, 0,8974, 0,8376). Betragt en 2-periode annuitetsobligation med en hovedstol på 100. Hvilken kuponerente skal der være, for at obligationen har en kurs på 100 på tidspunkt 0 (handler til pari)? Vi kigger nu på variationer af annuitetsobligationen fra spørgsmål 3a.",
        "Spg. 3b": "Variabelt forrentet annuitet. Her dannes en betalingsrække, hvor afdragene er som for annuiteten fra spg. 3a, men rentebetalingerne er bestemt ud fra den korte (markeds)rente, specifikt it=(t-1)×Ht-1 med notation fra noternes kapitel 2. Eftervis at tid 0-kursen på denne obligation er 100 og angiv kurser og betalinger for alle relevante tidspunkter og tilstande. (Tegn et træ.)",
        "Spg. 3c": "Konverterbar annuitet. Beregn tid 0-kursen på denne obligation. Antag at, hvis lånet indfris,\nså omlægges gælden til en inkonverterbar annuitet (med udløb på tid 2) og kuponrente lig markedsrenten på konverteringstidspunktet, r(t). Angiv betalinger for alle relevante tidspunkter\nog tilstande. (Igen: Tegn et træ.)"
    },
    "MatFin1_2017_Jan": {
        "Spg. 1a": "En investor køber 1 enhed af aktien p\bå tid 0 og sælger den igen p\bå tid 1. Hvad er den forventede årlige afkastprocent på denne strategi?",
        "Spg. 1b": "En investor køber 1 enhed af aktien P på tidspunkt 0 og holder den indtil tidspunkt 2, hvor han sælger den.\nTidspunkt 1-dividenden investeres på bankkontoen og trækkes ud herfra på tidspunkt 2. Hvad er den forventede årlige afkastrate på denne strategi?",
        "Spg. 1c": "En investor køber 1 enhed af aktien på tidspunkt 0 og holder den indtil tidspunkt 2, hvor han sælger den.\nTidspunkt 1-dividenden (gen)investeres i aktien, og denne position likvideres også på tidspunkt 2.\nHvad er den forventede annualiserede afkastrate på denne strategi?",
        "Spg. 1d": "Lad os formelt betegne aktiekursen X som V ovenfor. Hvad er E[X(2) | X(0) = 1]? Hvordan forholder dette tal sig til svarene på spørgsmål 2b og 2c?",
        "Spg. 1e": "Vis at hvis vi i stedet ser på Q-forventede afkast-rater, så ændrer svarene til spg. 1a-c sig alle tilsvarende, altså at alle de forventede afkast-rater er lig med den risikofrie rente.",
        "Spg. 2a": "Vis, at Y-kontrakten kan skrives som en portefølje af nulkuponobligationer og call-optioner.",
        "Spg. 2b": "Vis, at modellen er arbitrages-fri og komplett. Beregn den arbitrages-fri tid-0-pris for Y-kontrakten.",
        "Spg. 2c": "Hvad er den indledende sammensætning af den (aktie, bankbog) handelsstrategi, der replikerer Y-kontrakten?",
        "Spg. 2d": "En stor bank promoverer Y-kontrakten som et investeringsprodukt på følgende måde:\nSpil på aktiemarkedet uden nogen risiko! Hvis du investerer 100 $ hos os, kan du tjene op til 15%. Og hvis aktiemarkedet falder, får du dine penge tilbage.\n(Dette er baseret på en virkelig hændelse, så jeg har forsøgt at bevare den originale engelske ordlyd nogenlunde.)\nKommentar: Det er en dårlig forretning for investor, da der ikke findes investeringer uden risiko. Der er flere vildledende oplysninger i det relativt korte citat: påstanden om ingen risiko, det urealistiske løfte om at tjene op til 15% og idéen om at få pengene tilbage, hvis markedet falder.",
        "Spg. 3a": "Bestem EQ(t) for t= 0, 1, 2. Er Z-processen en Q-martingal?",
        "Spg. 3b": "Vis at nulkuponobligationspriserne på tidspunkt 0 er\n(P(0;1);P(0;2);P(0;3)) = (0,9709;0,9404;0,9061)\nog angiv relevante nulkupon- og forwardrenter for tid 0.",
        "Spg. 3c": "Angiv amortiseringsprofil og tid 0-kurs for et 3-periode seriel lån med 3% kuponrente og en oprindelig hovedstol på 100. (Et seriel lån er karakteriseret ved at have samme afdrag i hver periode.)",
        "Spg. 3d": "Hvad skal kuponrenten være for en serieobligation, hvor kursen er 100 ved tid 0?",
        "Spg. 3e": "Nu indføres et såkaldt udvidende serielån. Det har samme afdragsprofil som serielånet fra spg. 2c,\nmen den resterende hovedstol forrentes til enhver tid med den gældende korte rente. Udtrykt\ni Lando, Nielsen og P-noternes notation (H for hovedstol), så er tid t-rentebetalingen givet\nved\nit=Ht-1*(1+rkort)^(t-1):\nHvad er tid 0-kursen på det udvidende serielån?"
    },
    "MatFin1_2020_okt": {
        "Spg. 1a": "Hvad er volatiliteten i modellen, der delvis er skjult bag æblet? (En talværdi, man kan slutte sig til ud fra ovenstående informationer.) Hvordan ser det fulde aktiegitter ud? (Kan du ikke svare på det spørgsmål, så brug en plausibel værdi i det følgende.)",
        "Spg. 1b": "Hvad skal der gælde for den (konstante, diskret tilskrevne) risikofrie 1-periode rente, r, for at den betragtede model er (i) arbitragefri, (ii) komplet? Forekommer det empirisk/praktisk rimeligt?\nAntag i det følgende r= 0,02 (dvs. renten er 2% pr. periode).",
        "Spg. 1c": "Betragt en udløbende 3-futures-kontrakt med aktien som underliggende aktiv. Beregn tid 0-futuresprisen, Fut 0 (notation fra slides) eller 0 (notation fra noterne). Angiv futures-kontraktens betalinger på tid 1 og tid 2. (Sidstnævnte er stiafhængig.)",
        "Spg. 1d": "Betragt (europæiske) udløb 3-call- og -put-optioner (på aktien) med strike K = Fut(0; 3).\n(Brug en anden fornuftig strike-værdi, hvis du ikke har kunnet regne foregående spørgsmål.)\nBeregn tid 0-priserne på disse to optioner. Angiv den initiale sammensætning af den (futures-\nkontrakt, risikofrit aktiv)-strategi, der replikerer call-optionen.",
        "Spg. 2a": "Beregn korrelationen (under P) mellem de to aktiers afkast. (Husk at ikke alle tilstande er lige sandsynlige.)\nNu betragtes en såkaldt spread-option. Det er et aktiv, der på tid 1 betaler p * S1(1) * S2(1) - 100.",
        "Spg. 2b": "Hvad er intervallet for arbitragefri 0-pris på en spread-option?",
        "Spg. 3a": "Er modellen komplet, hvis nulkuponobligationspriser (naturligt ordnet) ved tid 0 er givet ved (0,9804; 0,9633; 0,9512)?",
        "Spg. 3b": "Betragt en 3-periode-annuitetsobligation med en hovedstol på 100. Hvad skal kuponrenten være for, at obligationen har en kurs på 100 ved tidspunkt 0 (handler til pari)?",
        "Spg. 3c": "(Benyt de risikoneutrale sandsynligheder fra modelspecifikationen i begyndelsen af opgaven til at beregne priser i dette spørgsmål | uanset komplethed eller ej.) For hvilke kuponrenter vil konverterbare (callable) 3-periode-annuitetsobligationer handle til par på tid 0?"
    },
    "MatFin1_2015_Dec": {
        "Spg. 1a": "Vis at modellen er arbitragerifri og komplet.\nNu betragtes en udløb-2, strike-100 såkaldt digital (eller binær) option på aktien. Herved forstås en kontrakt, der betaler 1 på tid 2 hvis aktiekursen der er skarpt større end 100; payo\u000b er med andre ord (indikatorfunktionsnotation) 1S(2)>100.",
        "Spg. 1b": "Bestem prisen på den digitale option ved tid-0. Angiv den oprindelige sammensætning af den replikerende (aktie, bankbog)-portefølje.\nEt firma tilbyder nu den digitale option i en 'pengene tilbage'-version. Dette betyder, at hvis aktiekursen ender på samme niveau som den startede, får optionskøberen sin oprindelige investering tilbage (det vil sige det beløb, han betalte for optionen).",
        "Spg. 1c": "Hvad er tid 0-prisen på 'pengene tilbage'-optionen? (Vink: Opstil en ligning, hvor den ukendte pris indgår på begge højre- og venstresiden.) I en standard binomial model med meget små tidsskridt, hvad er værdien af 'pengene tilbage'-rettigheden?",
        "Spg. 1d": "Kommenter følgende udsagn:\nDa optioner har begrænset tabspotentiale, det vil sige der er en grænse for, hvor meget man kan tabe, så vil deres værdi øges i takt med volatiliteten.",
        "Spg. 2a": "Hvad er det forventede afkast på aktien?",
        "Spg. 2b": "Betragt en call-option (på aktien) med en strike-kurs på 110 (og udløb på tidspunktet 1). Bestem den arbitragefrie øvre grænse for tid-0-call-optionsprisen.",
        "Spg. 2c": "Bestem den arbitragefri nedre grænse for tid-0-call-optionsprisen for call-optionen fra spg. 2b. Argumenter for at hvis call-optionen handles til præcis denne pris, så er der arbitrage i modellen. (Bemærkning: Dette viser, at medmindre det degenererer til et enkelt punkt, så skal prisintervallet i noten \\Arbitrage-free Prices and Linear Programming\" retteligt være åbent i begge ender.)",
        "Spg. 3a": "De angivne nulkuponobligationspriser (i naturlig rækkefølge) på tidspunktet 0 er givet som (0,99010; 0,97554; 0,95374). Angiv nulkuponrenterne på tidspunktet 0.",
        "Spg. 3b": "Angiv betalingsrækken for en 3-årig annuitetsobligation med en initial hovedstol på 100 og en kuponrente på 0,015 (1,5%). Hvad er obligationens tid 0-kurs?",
        "Spg. 3c": "Beregn tid 0-kursen på den konvertible variant af annuiteten fra spørgsmål 3b. (Ved konvertibel forstås, at låntageren når som helst han ønsker det, kan slippe ud af sine fremtidige forpligtelser ved at betale den resterende hovedstol; han kan indfri sit lån tidligt; han har en amerikansk option.)",
        "Spg. 4a": "Bestemmes på følgende måde:\nEt(M(t+1)) = M(t) for alle t ≥ 0;\nhvor betingelsen gælder for X'ernes naturlige filtrering. (Hvis det ikke var fordi, at vi kun har defineret martingalitet for endelige følger, ville vi sige, at M dermed blev en martingal.)"
    },
    "MatFin1_2017_Okt": {
        "Spg. 1a": "Vis at dette er et specialtilfælde af standard binomialmodellen og at modellen er arbitragefri og komplet.",
        "Spg. 1b": "Bestem tid-0 priser på at-the-money europæiske udløb-2 call- og put-optioner på aktien.",
        "Spg. 1c": "Nu betragtes en såkaldt log-stock kontrakt, som er en kontrakt, der på tid 2 betaler\nln(2) := ln(S(2)/S(0)):\nBestem den arbitragefri tid 0-pris på log-stock kontrakten og angiv, hvordan den replikeres\nmed aktien og bankbogen.",
        "Spg. 1d": "Antag nu, at der er transaktionsomkostninger forbundet med aktiehandel. Mere specifikt: Hver gang man handler aktier for x kr., så skal man betale 0,01x kr. i handelsomkostninger; dvs. proportionale omkostninger på 1%. Det antages stadig omkostningsfrit at benytte bankbogen. Angiv (i et træk) omkostningerne for den replikerende strategi fra spg. 1c. Beregn de Q-forventede diskonterede omkostninger og diskuter, hvor meningsfuldt dette tal egentlig er.",
        "Spg. 2a": "Antag at man på tidspunkt 0 køber 1 enhed af aktien. Hvad er den forventede afkast rate for den strategi? Hvad er afkast ratens spredning?\nVi kalder (1)=S(0) for aktiens dividende rate. Hvad er den forventede dividende rate? Hvad er korrelationen mellem strategiens afkast rate og aktiens dividende rate?",
        "Spg. 2b": "Betragt nu et nyt aktiv, hvis tid 1-betaling er aktiens dividende; x= ð(1) med ofte anvendt notation. I samme notation har vi, at en række i D-matricen udgøres af S(1) +ð(1). Bestem det arbitragefri interval af tid 0-priser for dette aktiv.\n\nDer introduceres nu en forward-kontrakt på aktien. Antag, at forwardprisen er Fwd(0;1) = 98.",
        "Spg. 2c": "Forekommer dette som en plausibel forwardpris? Hint: Det er mere argumentationen/analysen end selve svaret (der nok er \"ja\"), der er vigtig. Man kan tage udgangspunkt i hjælpespørgsmålet: Hvad kunne man sige, hvis ɛ (1) var deterministisk?",
        "Spg. 2d": "Besvar spg. 2b igen i tilfældet, hvor forward-kontrakten handles på tid 0. Kommenter dine resultater.\nHint: D=0\nS(1) + D(1)\n1 + r\nS(1) - Fwd(0;1)1\nA{ med rækkerne forstået som vektorer på passende vis.",
        "Spg. 3a": "Forklar hvorfor et konverterbart lån (fra låntagernes synspunkt) kan ses som en kort position i en in konverterbar obligation kombineret med en lang position i en amerikansk call-option."
    },
    "MatFin1_2014_Dec": {
        "Spg. 1a": "Bestem den forventede P-mængde af ekstra afkast p på aktien i forhold til bankbogen for alle relevante knuder.",
        "Spg. 1b": "Visat modellen er arbitragefri og komplet.\nBetragt en såkaldt asiatisk option. Det er en kontrakt, der på tid t=0 betaler 1/32 * X * (S(t)-95), hvor S(t) er aktiekursen.",
        "Spg. 1c": "Beregn den arbitragesikre tid 0-pris på den asiatiske option.",
        "Spg. 1d": "Hvordan kan en asiatisk option replikeres?",
        "Spg. 2a": "Beregn korrelationen (under P) mellem afkastraterne for de to aktier.",
        "Spg. 2b": "Vis at modellen er arbitragefri, men ikke komplet.\nNu betragtes en såkaldt Margrabe-option. Dette er et aktiv, der på tid 1 betaler (S1(1) - S2(1))+.",
        "Spg. 2c": "Angiv intervallet for arbitragefrie priser på 0-tidspunktet for Margrabe-optionen.",
        "Spg. 3a": "De givne nulkuponobligationspriser (naturligt ordnet) ved tid 0 er givet ved (0,96154; 0,92032; 0,87930). Angiv de tilsvarende nulkuponrenter ved tid 0.",
        "Spg. 3b": "Angiv betalingsrækken for en 30-årig annuitetsobligation med initial hovedstol p = 100 og kuponrente 0,04 (4%). Hvad er dens tid 0-kurs? (Der mindes om annuitetsformlen, y= Hv*(1-(1+c)^-n)/c, der knytter ydelse y, initial hovedstol H, kuponrente c og løbetid n sammen.)",
        "Spg. 3c": "Beregn tid 0-kursen på den konverterbare variant af annuiteten fra spg. 3b. (Ved konverterbar forstås, at låntageren når som helst han ønsker det, kan slippe ud af sine fremtidige forpligtelser ved at betale den resterende hovedstol; han kan indfri sit lån før tid; han har en amerikansk option.)",
        "Spg. 3d": "Fremtidige og fremtidige kontrakter med udløb på tidspunktet 2 og med den ikke-konverterbare annuitet fra spg. 3b som underliggende. Beregn futures- og forwardpriserne for tidspunkt 0. Kommenter forskellene og lighederne.",
        "Spg. 4a": "Lad X₀, X₁, ..., XT være uafhængige, identisk fordelte stokastiske variable med middelværdi μ og varians σ² > 0. Sæt Y₀ = 0, lad a være en konstant, sæt Yₜ = Xₜ - a for t = 1, 2, ..., T og M(t) = Σⱼ=0 Yⱼ for t = 0, 1, ..., T.\n\nKan du vælge a, så M er en martingal (mht. X'ernes naturlige filtrering)?\nÆndrer dit svar sig, hvis Y'erne i stedet var defineret ved Yₜ = Xₜ - Xₜ-1 - a?"
    },
    "MatFin1_2015_Okt": {
        "Spg. 1a": "Er modellen arbitragefri? Er modellen komplet?",
        "Spg. 1b": "Nu betragtes en udløbs-2, strike-100 europæisk call-option på en aktie. Beregn den arbitragefri tid 0-pris på denne. Angiv den initiale sammensætning af den replikerende (aktie, bankbog)-portefølje.",
        "Spg. 1c": "Hvad er den arbitragefrie pris på en udløb-2, strike-100 europæisk put-option på aktien? Hvad koster den tilsvarende amerikanske put-option?",
        "Spg. 1d": "Analyse er prisfastsættelse og replikation, hvis der i stedet betragtes en europæisk udløb-3, strike-100 call-option.",
        "Spg. 1e": "Analyse er prisfastsættelse og replikation, når der i stedet betragtes en europæisk udløb-3, strike-100 put-option. (Vink: Analysen i spg. 1d og put/call-pariteten kan med fordel kombineres.)",
        "Spg. 1f": "Analyse er prisfastsættelse og replikation, når der i stedet betragtes en europæisk udløb-3, strike-64 call-option. (Hint: Prisinterval.)",
        "Spg. 2a": "Bestem EQ(Z(t)) for t = 0, 1, 2. Er Z-processen en Q-martingal?",
        "Spg. 2b": "De viser på 0-tiden er givet som (0;97087; 0;93824; 0;89603). Angiv nulkupon-, forward- og swaprenterne på 0-tiden.",
        "Spg. 2c": "Angiv amortiseringsprofilen (dvs. betalingsrækken delt op i ydelser (yt), rentebetalinger (it), samt afdrag (ẞt) og resterende hovedstol (Ht)) for en 3-årig annuitetsobligation med en initial hovedstol på 100 og en kuponrente på 0,03 (3%).",
        "Spg. 2d": "Hvad skal kuponrenten være, for at en annuitetsobligation som i opg. 2c har en tid 0-pris på 100 (dvs. \"den handles til par\")? (Vink: En ligning skal løses numerisk her.)",
        "Spg. 2e": "Nu betragtes en forwardkontrakt med annuiteten fra spg. 2c som underliggende aktiv. Forwardkontrakten udløber på tid T=1 (i almindeligt anvendt notation). Beregn den initiale forwardpris, Fwd(0;T)."
    },
    "MatFin1_2018_Jan": {
        "Spg. 1a": "Beregn de P-forventede 1-periode afkastrates for aktien i de forskellige knuder. Hvad er\nafkastenes (P-)spredninger?",
        "Spg. 1b": "Vis, at modellen er arbitragefri og komplet. Er modellen et specialtilfælde af standardbinomialmodellen?",
        "Spg. 1c": "Beregn den arbitragefrie pris på en europæisk put-option (på aktien, først og fremmest), der er \"at-the-money\" på tid 0 og har udløb på tid 2. Angiv den replikerende (aktie, bankbog)-strategi.",
        "Spg. 1d": "Beregne den arbitragefrie pris på en amerikansk put-option, som er ved-kassen på tidspunktet 0 og har udløb på tidspunktet 2.",
        "Spg. 2a": "Vis at arbitragefri nulkuponobligationspriser på tidspunkt 0 er givet ved\n(P(0,1);P(0,2);P(0,3)) = (0,9804;0,9641;0,9528):",
        "Spg. 2b": "Betragt nu en 3-periode-annuitetsobligation med en indledende hovedstol på 100. Hvad skal kuponrenten være for, at obligationens kurs ved tidspunkt 0 er 100? (Dvs. at den handler til pari.)",
        "Spg. 2c": "Betragt nu en forward-kontrakt på en annuitetsobligationen fra spg. 2b, hvor forward-kontrakten udløber på tid 2. Bestem tid 0-forwardprisen, Fwd(0 ;2).",
        "Spg. 2d": "En såkaldt cap-kontrakt består af en række call-optioner på renten, hvor man specifikt betaler (r(t))+p på tidspunkt t= 1;2, hvor konstanten p er en strike-pris. Hvad kan du sige om arbitragefri tid 0-pris(er) på en cap-kontrakt med p= 0.015? (Et korrekt svar kan bestå af 1 tal + en kvalitativ forklaring.)",
        "Spg. 3a": "Betragt en følge fXtgT, t=1, af uafhængige identisk fordelte stokastiske variable, hvor Xt kan antage værdierne -1, 0 og 1, hver med sandsynlighed 1/3. Sæt Yt = eXt * c, hvor c er en konstant, og definer M0 = 1 og Mt = Qt for j=1, Yj = Y1 * Y2 * ... * Yt for 1 ≤ t ≤ T. Bestem c, således at M er en martingal (mht. det naturlige filter)."
    },
    "MatFin1_2018_Nov": {
        "Spg. 1a": "Antag, at du er på tidspunkt 2 i den knude, hvor aktiekursen er 110.26. Hvad er den (betingede) forventede afkastrate på aktien over den næste periode? Hvad er afkast-ratens (betingede) spredning (under P)?",
        "Spg. 1b": "Vis, at modellen er arbitragefri og inkomplet. Tip: Mange af en-periode-delmodellerne har en lignende struktur.",
        "Spg. 1c": "Beregn de fremtidige (forward) priser for forwardkontrakter (på aktien) med udløb på tidspunkt 1, 2 og 3;\nFwd(0;T) for T = 1, 2 og 3 er den almindeligt anvendte notation. Hvorfor er Fwd(0;3) entydigt bestemt?",
        "Spg. 1d": "Beregn prisen på en europæisk call-option med udløb om 2 tid og en strejkurs på K= Fwd(0;2) (dvs. at optionen er forward-at-the-money). Sammenlign denne pris med prisen på den tilsvarende put-option.",
        "Spg. 1e": "Find den replikerende (aktie, bankbog)-strategi for en af optionerne fra spørgsmål 1.d.",
        "Spg. 1f": "Antag nu (igen), at du står på tidspunkt 2 i den knude, hvor aktiekursen er 110.26. Beregn det arbitragefrie prisinterval for en call-option med strikepris K=120 og udløbstidpunkt T=3.",
        "Spg. 2a": "De nulkuponsobligationers priser ved tid 0 er (P(0;1); P(0;2); P(0;3)) = (0,9901; 0,9768; 0,9519).",
        "Spg. 2b": "Beregn tid 0-swap-renter.\nNu betragtes en såkaldt swaption, der som ordet antyder, er en option på en swap-rente.\nHelt præcist er det en kontrakt, der på et indfrielsestidspunkt giver ret, men ikke pligt, til at indgå en payer-swap (dvs. man betaler fast rente) med fast rente \u0014, kaldet swaptionens strike-rente. Tidslinjen for betalinger (samt definition af notation) fremgår af figuren nedenfor:\n::: -? idag\nt TI? swaptionens indfrielsesdag, dvs. her besluttes, om payer-swap med fast rente skal indgås\n? ? swappens start\nTn?1. swap-betaling\nTn+1=Tn+▀ Tm? swappen slutter, dvs. dens sidste betalingsdag\ntid-",
        "Spg. 2c": "Argumenterne for at swaptionens værdi ved indfrielsestidspunktet TI (dens pay-off) er\n\nVær opmærksom på, at tid TI-swap-renten netop er den rente på det faste ben, der giver den underliggende swap værdien 0; en kort position såvel som en lang position kan derfor indgå på markedet til prisen 0. Hvad gør man ved indfrielsestidspunktet når swap-renten er henholdsvis højere eller lavere end strike-renten? Den præcise formel for swap-renten spiller ikke nogen synderlig rolle her.",
        "Spg. 2d": "Antag den følgende tekst:\n\nAntag n=0 og betragt en swaption med TI=Tn=1, T_0=1, T_m=3 og sigma=0.02. Beregn swaptionens tid 0-pris.",
        "Spg. 3a": "Hvordan konstrueres en (ikke-triviel) risikofri portefølje, dvs. hvordan spiller man på en sådan måde, at uanset udfaldet af afstemningen, så får man samme tilbagebetaling? Hvad er prisen på denne strategi (eller: indsatserne på spillene), og hvordan fortolker du dette tal? To ting viser sig at nuancere situationen fra spg. 3a. For det første påvirker udfaldet af afstemningen den britiske valutakurs. Antag specielt, at dollar-pund-kursen (forstået som det antal dollars, man skal betale for 1 pund) er beskrevet ved binomialmodellen angivet ude til højre. For det andet er bookmakerens regler sådan, at man som spiller selv - og uden at det påvirker odds - kan vælge i hvilken valuta, man vil gøre sin indsats - hvorefter evt. gevinst så udbetales i denne valuta."
    },
    "MatFin1_2014_Okt": {
        "Spg. 1a": "Vis at modellen er et specialtilfælde af standardbinomialmodellen, S(t+Δt) = S(t) · exp(σ·√(Δt) · Z), hvor Z er en standard normalfordelt stokastisk variabel. Vis at modellen er arbitragefri og komplet. Hvorfor kunne man umiddelbart tro, at dette ikke var tilfældet?",
        "Spg. 1b": "Betragt en futureskontrakt med udløb på tid t og aktien som underliggende aktiv. Angiv futuresprisprocessen og kontraktens betalinger.",
        "Spg. 1c": "Bestem tid 0-prisen på en europæisk udløb-2, strike-92 call-option på aktien. Beregn tid\n0-sammensætningen af en (bankbog, futureskontrakt fra spg. 1b)-portefølje, der replikerer\ncall-optionen.",
        "Spg. 1d": "Prisfastsæt den amerikanske version af call-optionen fra spg. 1c og angiv, hvilke perioder der indløses optionen. Kommenter dine resultater.",
        "Spg. 2a": "Angiv filtrene for henholdsvis pris- og dividendeprocessen. Er nogle af disse betydningsfulde?",
        "Spg. 2b": "Vis at modellen er arbitragefri, men ikke komplet.\nNu betragtes en såkaldt Shiller-kontrakt. Dette er et aktiv, der på tid 2 udbetaler den kumulerede dividende langs den indtrufne sti; D(1) + D(2) i kompakt notation.",
        "Spg. 2c": "Se på tiden-1-ned-knuden. Bestem i denne knude intervallet af arbitragefri priser for Shiller-kontrakten.",
        "Spg. 2d": "Antag, at Shiller-kontrakten på tidspunkt 0 handles til prisen 2,89. Vis venligst, at modellen er fri for arbitrage og komplet.",
        "Spg. 3a": "Bestem EQ[ξ(t)] for t = 0, 1, 2. Er ξ-processen en Q-martingal?",
        "Spg. 3b": "Vis at nulkuponobligationspriserne på tid 0 er:\n(P(0,1);P(0,2);P(0,3)) = (0,97087; 0,94295; 0,91611)\nog angiv nulkuponrenterne på tid 0.",
        "Spg. 3c": "Beregn forwardrenterne og swap-renterne for en tidsperiode på 1, ved tiden 0.",
        "Spg. 3d": "Betragt et variabelt forrentet 3-periode stående lån med en hovedstol på 100. Her antages det, at rentebetalingen på tid t er 100*(t-1) og at alle afdrag betales ved tid 3. Vis at dette lån altid har en kurs (eller pris) på 100 (dvs. det handles til par).",
        "Spg. 3e": "Det variabelt forrentede lån fra spg. 3d udstyres nu med et loft. Herved forstås at afdragsprocenten er den samme, men at rentebetalingen på tid t er 100*(1-(0,03)^t), hvor t er en konstant. Beregn tid-0 prisen lånet med loft når \u0016= 0,03.",
        "Spg. 4a": "Proposition 10 i Lando & Poulsens noter fortæller, at qi/piu0(ci); hvor ci er det optimale forbrug for en forventet nyttemaksimerende agent med nyttefunktion u og betyder \"proportional med\". Det er blevet udlagt på følgende måde: I et komplet marked giver resultatet en nem metode til at bestemme (op til en proportionalitetsfaktor) en vilkårlig agents optimale forbrug/portefølje. Forklar og kommenter."
    }
}